'use client'

import { useState } from 'react'

import CommentRating from './CommentRating'

const Comment = ({}) => {
  return (
    <div className='border-[#DBDBDB] py-8 [&:not(:last-child)]:border-b'>
      <div className='mb-[13px] flex items-start gap-x-[7px]'>
        <CommentRating initialValue={5} maxRating={5} />
        <span className='text-15 leading-4 tracking-[-0.6px] text-fontBlack'>
          5.0
        </span>
      </div>
      <div className='mb-3 text-15 font-medium leading-none tracking-[-0.6px] text-fontBlack'>
        Создать дизайн сайта визитки с каталогом
      </div>
      <div className='mb-3 text-12 leading-none tracking-[-0.48px] text-fontGrey'>
        <span>02 июл. 2023 – 08 июл. 2023</span>
      </div>
      <p className='text-15 font-normal italic leading-[1.33] tracking-[-0.3px] text-fontDarkGrey'>
        Результат работы превзошел все ожидания! Елена очень тонко почувствовала
        все наши эмоции и чувства, которые хотелось переложить на изображение.
        Все сошлось и милота, и нежность, и детство, и ассоциативный ряд с
        хитрой лисой о котором я даже подумать не мог. Огромное спасибо за
        работу. Даль...
      </p>
      <div className='mt-2.5 flex items-center gap-x-[30px]'>
        <div className='flex items-center gap-x-[7px]'>
          <span className='text-15 leading-[1.06] tracking-[-0.6px] text-fontBlack'>
            Sergey F.
          </span>
          <svg
            xmlns='http://www.w3.org/2000/svg'
            width='15'
            height='14'
            viewBox='0 0 15 14'
            fill='none'
          >
            <path
              d='M6.76759 7.64451L5.62359 6.49738C5.50659 6.37587 5.36315 6.31511 5.19327 6.31511C5.0234 6.31511 4.87469 6.37267 4.74715 6.48779C4.62252 6.61107 4.5602 6.75578 4.5602 6.9219C4.5602 7.08803 4.62252 7.23184 4.74715 7.35335L6.30824 8.86402C6.43819 8.99248 6.5913 9.05671 6.76759 9.05671C6.9439 9.05671 7.09702 8.99248 7.22696 8.86402L10.2528 5.92538C10.3728 5.81027 10.432 5.67018 10.4305 5.5051C10.4291 5.34002 10.366 5.19903 10.2414 5.08213C10.1215 4.97446 9.97851 4.92177 9.81245 4.92408C9.64639 4.92638 9.50813 4.98226 9.39768 5.09172L6.76759 7.64451ZM4.84306 13.6772L3.81126 11.9614L1.78061 11.55C1.6194 11.5204 1.48732 11.4376 1.38437 11.3016C1.28142 11.1656 1.24139 11.0186 1.26428 10.8606L1.48743 8.91022L0.167914 7.4175C0.0559713 7.30198 0 7.16281 0 7C0 6.83719 0.0559713 6.69802 0.167914 6.5825L1.48743 5.10093L1.26428 3.15058C1.24139 2.99253 1.28142 2.84552 1.38437 2.70956C1.48732 2.57357 1.6194 2.4899 1.78061 2.45855L3.81126 2.04977L4.84306 0.322769C4.92847 0.184937 5.04965 0.089223 5.20659 0.0356296C5.36353 -0.017975 5.51978 -0.0110242 5.67535 0.0564807L7.5 0.862875L9.32465 0.0564807C9.48022 -0.00923928 9.63647 -0.0176063 9.79341 0.0313797C9.95035 0.0803657 10.0715 0.173774 10.1569 0.311607L11.2002 2.04977L13.2194 2.45855C13.3806 2.4899 13.5127 2.57357 13.6156 2.70956C13.7186 2.84552 13.7586 2.99253 13.7357 3.15058L13.5126 5.10093L14.8321 6.5825C14.944 6.69802 15 6.83719 15 7C15 7.16281 14.944 7.30198 14.8321 7.4175L13.5126 8.91022L13.7357 10.8606C13.7586 11.0186 13.7186 11.1656 13.6156 11.3016C13.5127 11.4376 13.3806 11.5204 13.2194 11.55L11.2002 11.9614L10.1569 13.6884C10.0715 13.8262 9.95035 13.9196 9.79341 13.9686C9.63647 14.0176 9.48022 14.0092 9.32465 13.9435L7.5 13.1371L5.67535 13.9435C5.51978 14.0092 5.36353 14.0157 5.20659 13.963C5.04965 13.9103 4.92847 13.8151 4.84306 13.6772Z'
              fill='#039DF7'
            />
          </svg>
        </div>
        <span className='text-15 leading-[1.06] tracking-[-0.6px] text-fontGrey'>
          1 500 ₽ / проект
        </span>
        <span className='text-15 leading-[1.06] tracking-[-0.6px] text-fontGrey'>
          14 дней
        </span>
      </div>
    </div>
  )
}

export default Comment
