'use client'

const placeholderTextArea = `Например, нам нужен уникальный логотип для нашего нового проекта - приложения для трекинга физической активности.

Желаем, чтобы логотип был ярким, современным и отражал динамику движения.
Целевая аудитория - молодые люди в возрасте 18-30 лет.
Ожидаем 3 варианта на выбор с возможностью корректировки.
Готовы рассмотреть ваши идеи и пожелания.`

const FourthStep = () => {
  return (
    <div className=''>
      <div className='border-b border-[#DBDBDB] pb-7'>
        <div>
          <div className='mb-2 text-22 leading-none tracking-[-0.44px] text-fontBlack'>
            Общая информация
          </div>
          {/*  */}
        </div>
        <div className='font-secondFamily text-24 font-bold leading-[1.12] tracking-[-0.48px] text-greenDark'>
          Шаг 4/5
        </div>
      </div>

      <div className='flex flex-col gap-y-9 pt-[34px]'>
        <div>
          <div className='mb-2 text-17 leading-[1.3] tracking-[-0.17px] text-fontBlack'>
            Загрузить файлы
          </div>
          <span className='mb-[30px] inline-block max-w-[575px] text-15 leading-[1.33] tracking-[-0.15px] text-fontDarkGrey'>
            Загрузите все файлы, которые могут помочь исполнителю лучше понять
            вашу задачу, это могут быть примеры дизайна, техническое задание,
            макеты и т.д.
          </span>

          <div className='mb-6 flex max-w-[177px] items-center justify-center'>
            <label
              htmlFor='input-file'
              id='drop-area'
              className='group flex h-[260px] w-full cursor-pointer items-center justify-center overflow-hidden rounded-[15px] border-2 border-dashed border-greenLight text-center'
            >
              <input type='file' id='input-file' hidden />
              <div
                style={{ backgroundImage: `url(${''})` }}
                className='flex h-full w-full items-center justify-center bg-cover bg-center bg-no-repeat'
              >
                <div className='flex flex-col items-center justify-center'>
                  <div className='up-icon mb-[15px] h-[30px] w-[30px] text-greenDark'>
                    <svg
                      xmlns='http://www.w3.org/2000/svg'
                      role='image'
                      viewBox='0 0 31 31'
                      fill='none'
                    >
                      <path d='M3.16304 30.6643C2.2864 30.6643 1.54007 30.3569 0.924041 29.7422C0.308014 29.1275 0 28.3827 0 27.5079V3.26271C0 2.38604 0.308014 1.63971 0.924041 1.02371C1.54007 0.407682 2.2864 0.0996679 3.16304 0.0996679H17.584C18.0284 0.0996679 18.4025 0.253361 18.7064 0.56075C19.0102 0.868111 19.1622 1.24451 19.1622 1.68996C19.1622 2.1354 19.0102 2.50889 18.7064 2.81042C18.4025 3.11195 18.0284 3.26271 17.584 3.26271H3.16304V27.5079H27.4082V13.1081C27.4082 12.6636 27.5606 12.2895 27.8654 11.9857C28.1702 11.6818 28.5455 11.5299 28.9913 11.5299C29.4371 11.5299 29.8108 11.6818 30.1123 11.9857C30.4139 12.2895 30.5646 12.6636 30.5646 13.1081V27.5079C30.5646 28.3827 30.2561 29.1275 29.639 29.7422C29.022 30.3569 28.2784 30.6643 27.4082 30.6643H3.16304ZM24.2974 6.40129H22.2685C21.8552 6.40129 21.5094 6.26135 21.231 5.98146C20.9526 5.7016 20.8134 5.35481 20.8134 4.94108C20.8134 4.52361 20.9519 4.1775 21.229 3.90275C21.5061 3.62803 21.8526 3.49067 22.2687 3.49067H24.2974V1.45783C24.2974 1.04714 24.4364 0.7015 24.7144 0.420916C24.9924 0.140305 25.3401 0 25.7576 0C26.1713 0 26.5165 0.139792 26.7931 0.419375C27.0697 0.698958 27.208 1.04539 27.208 1.45867V3.49067H29.2369C29.6465 3.49067 29.9914 3.62965 30.2716 3.90763C30.5519 4.18563 30.692 4.53225 30.692 4.9475C30.692 5.36278 30.5535 5.70889 30.2765 5.98584C29.9994 6.26281 29.6528 6.40129 29.2367 6.40129H27.208V8.43013C27.208 8.83971 27.0681 9.18462 26.7883 9.46487C26.5084 9.74515 26.1616 9.88529 25.7479 9.88529C25.3304 9.88529 24.9843 9.74676 24.7095 9.46971C24.4348 9.19265 24.2974 8.84607 24.2974 8.42996V6.40129ZM14.0078 22.4131L10.772 18.1477C10.6062 17.9337 10.3966 17.8267 10.1434 17.8267C9.8902 17.8267 9.68065 17.9337 9.51479 18.1477L6.25967 22.3992C6.05233 22.6753 6.02475 22.955 6.17692 23.2383C6.32911 23.5215 6.56733 23.6631 6.89158 23.6631H23.7008C24.0158 23.6631 24.2482 23.5212 24.398 23.2374C24.5477 22.9537 24.526 22.6743 24.3328 22.3992L19.8276 16.3977C19.6617 16.1837 19.4522 16.0767 19.199 16.0767C18.9458 16.0767 18.7362 16.1837 18.5704 16.3977L14.0078 22.4131Z' />
                    </svg>
                  </div>
                  <p className='text-13 leading-[1.23] tracking-[0.13px] text-fontDarkGrey group-hover:text-greenDark'>
                    Перетащите файл или{' '}
                    <span className='text-greenDark'>загрузите</span>
                  </p>
                </div>
              </div>
            </label>
          </div>

          <div className='mb-6 flex flex-col gap-y-5 text-13 leading-none tracking-[-0.13px] text-fontDarkGrey'>
            <div>
              Изображения (форматы .jpg, .png, .gif, размер не более 2 Мб),
            </div>
            <div>Видео (форматы .mp4, .mov, размер не более 10 Мб,</div>
            <div>Аудио (форматы .mp3, .wav, размер не более 2 Мб).</div>
            <div>Документы (форматы .pdf, .doc, .docx, .xls не более 2 Мб)</div>

            <span className='text-fontBlack'>Всего не более 10 файлов</span>
          </div>

          <div className='flex'>
            <div className='relative flex h-[260px] flex-[0_0_177px] flex-col items-center justify-center rounded-[15px] border border-[#DBDBDB]'>
              <button className='absolute right-[-10px] top-[-10px] inline-flex h-[25px] w-[25px] items-center justify-center rounded-[50%] border border-[#DBDBDB] bg-white'>
                <div className='up-icon h-[9px] w-[9px] text-fontBlack'>
                  <svg
                    xmlns='http://www.w3.org/2000/svg'
                    role='image'
                    viewBox='0 0 9 9'
                    fill='none'
                  >
                    <path d='M4.5 5.40659L1.59556 8.31103C1.46957 8.43701 1.31847 8.5 1.14226 8.5C0.966054 8.5 0.814956 8.43701 0.688968 8.31103C0.562989 8.18504 0.5 8.03395 0.5 7.85774C0.5 7.68153 0.562989 7.53043 0.688968 7.40444L3.59341 4.5L0.688968 1.59556C0.562989 1.46957 0.5 1.31847 0.5 1.14226C0.5 0.966055 0.562989 0.814957 0.688968 0.688968C0.814956 0.56299 0.966054 0.5 1.14226 0.5C1.31847 0.5 1.46957 0.56299 1.59556 0.688968L4.5 3.59341L7.40444 0.688968C7.53043 0.56299 7.68153 0.5 7.85774 0.5C8.03395 0.5 8.18504 0.56299 8.31103 0.688968C8.43701 0.814957 8.5 0.966055 8.5 1.14226C8.5 1.31847 8.43701 1.46957 8.31103 1.59556L5.40659 4.5L8.31103 7.40444C8.43701 7.53043 8.5 7.68153 8.5 7.85774C8.5 8.03395 8.43701 8.18504 8.31103 8.31103C8.18504 8.43701 8.03395 8.5 7.85774 8.5C7.68153 8.5 7.53043 8.43701 7.40444 8.31103L4.5 5.40659Z' />
                  </svg>
                </div>
              </button>
              <div className='up-icon h-[28px] w-[35px] text-greenDark'>
                <svg
                  xmlns='http://www.w3.org/2000/svg'
                  role='image'
                  viewBox='0 0 28 35'
                  fill='none'
                >
                  <path d='M14.0077 29.1666C15.8012 29.1666 17.3177 28.5383 18.5573 27.2818C19.7968 26.0252 20.4166 24.5146 20.4166 22.75V17.5C20.4166 17.1695 20.3048 16.8924 20.0812 16.6687C19.8576 16.4452 19.5805 16.3334 19.25 16.3334C18.9195 16.3334 18.6424 16.4452 18.4187 16.6687C18.1952 16.8924 18.0834 17.1695 18.0834 17.5V22.75C18.0834 23.8875 17.692 24.8524 16.9094 25.6448C16.1267 26.4372 15.157 26.8334 14 26.8334C12.8625 26.8334 11.8976 26.4372 11.1052 25.6448C10.3128 24.8524 9.91664 23.8875 9.91664 22.75V13.125C9.91664 12.6875 10.0576 12.3351 10.3396 12.0677C10.6215 11.8003 10.9667 11.6666 11.375 11.6666C11.8125 11.6666 12.1649 11.8003 12.4323 12.0677C12.6997 12.3351 12.8334 12.6875 12.8334 13.125V21C12.8334 21.3305 12.9452 21.6076 13.1687 21.8312C13.3924 22.0548 13.6695 22.1666 14 22.1666C14.3305 22.1666 14.6076 22.0548 14.8313 21.8312C15.0548 21.6076 15.1666 21.3305 15.1666 21V13.125C15.1666 12.0633 14.8013 11.166 14.0707 10.4329C13.34 9.69988 12.4455 9.33336 11.3873 9.33336C10.3291 9.33336 9.43056 9.69988 8.69168 10.4329C7.9528 11.166 7.58336 12.0633 7.58336 13.125V22.75C7.58336 24.5146 8.21241 26.0252 9.47052 27.2818C10.7286 28.5383 12.241 29.1666 14.0077 29.1666ZM2.91664 35C2.12914 35 1.44616 34.7108 0.867693 34.1323C0.289231 33.5538 0 32.8709 0 32.0834V2.91664C0 2.12914 0.289231 1.44616 0.867693 0.867694C1.44616 0.289232 2.12914 0 2.91664 0H18.6958L28 9.30418V32.0834C28 32.8709 27.7108 33.5538 27.1323 34.1323C26.5538 34.7108 25.8709 35 25.0834 35H2.91664ZM2.91664 32.0834H25.0834V10.675H18.7833C18.3701 10.675 18.0238 10.5352 17.7443 10.2557C17.4648 9.97624 17.325 9.62988 17.325 9.21668V2.91664H2.91664V32.0834Z' />
                </svg>
              </div>
              <span className='mt-3.5 text-13 leading-[1.23] tracking-[-0.13px] text-greenDark'>
                Instruction.pdf
              </span>
            </div>
          </div>
        </div>
      </div>
    </div>
  )
}

export default FourthStep
