'use client'

import Link from 'next/link'

import Comment from '@/components/CatalogComment/Comment'
import CommentRating from '@/components/CatalogComment/CommentRating'
import Button from '@/components/ui/Button'

import styles from './expert.module.scss'

const ExpertModal = ({ onClose }) => {
  return (
    <div className={styles.expert}>
      <div className='flex items-center justify-between px-5'>
        <button
          onClick={onClose}
          className='flex h-6 w-6 items-center justify-center rounded-[50%] border border-fontDarkGrey'
        >
          <svg
            className='h-[10px] w-[10px] flex-[0_0_10px]'
            xmlns='http://www.w3.org/2000/svg'
            width='10'
            height='10'
            viewBox='0 0 10 10'
            fill='none'
          >
            <path
              d='M5 6.13324L1.36945 9.76379C1.21196 9.92126 1.02309 10 0.802827 10C0.582568 10 0.393696 9.92126 0.23621 9.76379C0.0787367 9.60631 0 9.41743 0 9.19717C0 8.97691 0.0787367 8.78804 0.23621 8.63056L3.86677 5L0.23621 1.36945C0.0787367 1.21196 0 1.02309 0 0.802828C0 0.582568 0.0787367 0.393696 0.23621 0.23621C0.393696 0.078737 0.582568 0 0.802827 0C1.02309 0 1.21196 0.078737 1.36945 0.23621L5 3.86677L8.63056 0.23621C8.78804 0.078737 8.97691 0 9.19717 0C9.41743 0 9.60631 0.078737 9.76379 0.23621C9.92126 0.393696 10 0.582568 10 0.802828C10 1.02309 9.92126 1.21196 9.76379 1.36945L6.13324 5L9.76379 8.63056C9.92126 8.78804 10 8.97691 10 9.19717C10 9.41743 9.92126 9.60631 9.76379 9.76379C9.60631 9.92126 9.41743 10 9.19717 10C8.97691 10 8.78804 9.92126 8.63056 9.76379L5 6.13324Z'
              fill='currentColor'
            />
          </svg>
        </button>
        <Link
          href='/experts/1'
          target='_blank'
          className='ml-[19px] flex items-center gap-x-[6px]'
        >
          <span className='text-13 tracking-[-0.52px] text-greenDark hover:underline'>
            Открыть в новом окне
          </span>
          <div className='h-[10px] w-[10px]'>
            <svg
              className='h-full w-full text-greenDark'
              xmlns='http://www.w3.org/2000/svg'
              width='10'
              height='10'
              viewBox='0 0 10 10'
              fill='none'
            >
              <path
                d='M1.17211 10C0.84907 10 0.57296 9.88541 0.343776 9.65622C0.114592 9.42704 0 9.15093 0 8.82789V1.17712C0 0.852708 0.114592 0.575419 0.343776 0.345252C0.57296 0.115084 0.84907 0 1.17211 0H4.22528C4.38928 0 4.52795 0.0578078 4.6413 0.173424C4.75465 0.289031 4.81133 0.428909 4.81133 0.59306C4.81133 0.757211 4.75465 0.895593 4.6413 1.0082C4.52795 1.12081 4.38928 1.17712 4.22528 1.17712H1.17211V8.82789H8.82288V5.77472C8.82288 5.61072 8.87971 5.47205 8.99335 5.3587C9.107 5.24535 9.2459 5.18867 9.41005 5.18867C9.5742 5.18867 9.71356 5.24535 9.82813 5.3587C9.94271 5.47205 10 5.61072 10 5.77472V8.82789C10 9.15093 9.88492 9.42704 9.65475 9.65622C9.42458 9.88541 9.14729 10 8.82288 10H1.17211ZM8.82288 1.99944L4.32184 6.50549C4.20515 6.61957 4.06935 6.67388 3.91443 6.66842C3.75949 6.66296 3.62498 6.60319 3.51089 6.48911C3.39681 6.37502 3.33977 6.23944 3.33977 6.08238C3.33977 5.92531 3.39681 5.78973 3.51089 5.67564L8.00943 1.17712H6.28386C6.11985 1.17712 5.98118 1.1203 5.86783 1.00665C5.75448 0.893 5.69781 0.7541 5.69781 0.589949C5.69781 0.425798 5.75448 0.286438 5.86783 0.171868C5.98118 0.0572891 6.11985 0 6.28386 0H10V3.71614C10 3.88015 9.94219 4.01882 9.82658 4.13217C9.71097 4.24552 9.57109 4.30219 9.40694 4.30219C9.24279 4.30219 9.10441 4.24552 8.9918 4.13217C8.87919 4.01882 8.82288 3.88015 8.82288 3.71614V1.99944Z'
                fill='currentColor'
              />
            </svg>
          </div>
        </Link>
      </div>
      <div className='px-[60px]'>
        <div className={styles.header}>
          <div className={styles['header__column-info']}>
            <div className={styles.header__image}>
              <img src='/images/experts/user-card-mock.svg' alt='' />
            </div>
            <div className={styles.header__box}>
              <div className={styles.header__name}>Гений Г.</div>
              <div className={styles.header__location}>
                <span>Россия, Москва</span>
                <span>
                  <strong>21:30</strong> местное время
                </span>
              </div>
              <button className={styles.header__status}>
                <svg
                  xmlns='http://www.w3.org/2000/svg'
                  width='11'
                  height='11'
                  viewBox='0 0 11 11'
                  fill='none'
                >
                  <path
                    d='M0.596149 11C0.427236 11 0.285649 10.9404 0.17139 10.8213C0.0571298 10.7022 0 10.5586 0 10.3906C0 10.2225 0.0588943 10.0813 0.176683 9.9667C0.294471 9.85214 0.439101 9.79486 0.610573 9.79486H9.25C9.41891 9.79486 9.56049 9.85234 9.67476 9.96729C9.78902 10.0822 9.84615 10.2247 9.84615 10.3946C9.84615 10.5645 9.7873 10.7079 9.66959 10.8247C9.55188 10.9416 9.41042 11 9.2452 11H0.596149ZM8.6875 3.31776H9.8029V1.20514H8.6875V3.31776ZM2.46635 8.83457C1.77404 8.83457 1.1899 8.59726 0.713943 8.12265C0.237981 7.64803 0 7.0643 0 6.37147V1.35398C0 0.978723 0.132019 0.659242 0.396058 0.39554C0.660106 0.131847 0.980006 0 1.35576 0H3.18269L3.17788 1.82932L2.06458 2.72046C2.03755 2.74095 1.99519 2.82328 1.9375 2.96745V5.34691C1.9375 5.43783 1.97247 5.51768 2.04241 5.58647C2.11236 5.65525 2.1985 5.68965 2.30081 5.68965H4.70703C4.79977 5.68965 4.8822 5.65482 4.95432 5.58516C5.02643 5.5155 5.06249 5.43423 5.06249 5.34134V2.97337C5.06249 2.94689 5.02083 2.86322 4.9375 2.72238L3.83172 1.82932L3.83654 0H9.8029C10.1378 0 10.4211 0.118033 10.6526 0.354099C10.8842 0.590164 11 0.873846 11 1.20514V3.31776C11 3.65578 10.8842 3.94515 10.6526 4.18586C10.4211 4.42657 10.1378 4.54692 9.8029 4.54692H8.6875V6.37147C8.6875 7.0643 8.44792 7.64803 7.96876 8.12265C7.48958 8.59726 6.90705 8.83457 6.22115 8.83457H2.46635Z'
                    fill='currentColor'
                  />
                </svg>
                Свободен
              </button>
              <div className={styles.header__stats}>
                <div className={styles.header__rate}>
                  <span>
                    <strong className='font-medium'>1 500 ₽</strong>
                    <span aria-label='per hour'>/ час</span>
                  </span>
                </div>
                <div className={styles['header__completed-projects']}>
                  78 завершенных проектов
                </div>
                <div className={styles.header__raiting}>
                  <svg
                    xmlns='http://www.w3.org/2000/svg'
                    width='14'
                    height='14'
                    viewBox='0 0 14 14'
                    fill='none'
                  >
                    <path
                      d='M7 11.6828L3.51263 13.8831C3.37675 13.9705 3.23543 14.0089 3.08868 13.9983C2.94193 13.9876 2.81232 13.9386 2.69984 13.8512C2.58736 13.7638 2.50245 13.652 2.44509 13.5159C2.38772 13.3797 2.37617 13.227 2.41045 13.0578L3.33269 8.9018L0.252428 6.09807C0.126006 5.98254 0.0481134 5.85166 0.0187502 5.70541C-0.010613 5.55917 -0.00548867 5.41656 0.0341232 5.27761C0.0716801 5.13866 0.145831 5.02215 0.256576 4.92808C0.367322 4.83401 0.505718 4.77797 0.671764 4.75994L4.74069 4.38806L6.31713 0.463871C6.38036 0.307091 6.47652 0.190581 6.60561 0.11434C6.73471 0.0381138 6.86617 0 7 0C7.13383 0 7.26529 0.0381138 7.39439 0.11434C7.52348 0.190581 7.61964 0.307091 7.68287 0.463871L9.25931 4.38806L13.3313 4.75994C13.4953 4.77797 13.6327 4.83401 13.7434 4.92808C13.8542 5.02215 13.9283 5.13866 13.9659 5.27761C14.0055 5.41656 14.0106 5.55917 13.9812 5.70541C13.9519 5.85166 13.874 5.98254 13.7476 6.09807L10.6673 8.9018L11.5896 13.0578C11.6238 13.227 11.6123 13.3797 11.5549 13.5159C11.4976 13.652 11.4126 13.7638 11.3002 13.8512C11.1877 13.9386 11.0581 13.9876 10.9113 13.9983C10.7646 14.0089 10.6233 13.9705 10.4874 13.8831L7 11.6828Z'
                      fill='#24A322'
                    />
                  </svg>
                  <span>5.0 (81 отзыв)</span>
                </div>
                <div className={styles.header__level}>
                  <img src='/images/experts/diamond-blue.svg' alt='' />
                  <span>Продвинутый</span>
                </div>
              </div>
            </div>
          </div>
          <div className={styles['header__column-actions']}>
            <button className='flex h-[35px] w-[35px] flex-[0_0_35px] items-center justify-center rounded-[50%] border-2 border-[#D1D1D6]'>
              <svg
                xmlns='http://www.w3.org/2000/svg'
                width='16'
                height='4'
                viewBox='0 0 16 4'
                fill='none'
              >
                <path
                  d='M2 0C0.9 0 0 0.9 0 2C0 3.1 0.9 4 2 4C3.1 4 4 3.1 4 2C4 0.9 3.1 0 2 0ZM14 0C12.9 0 12 0.9 12 2C12 3.1 12.9 4 14 4C15.1 4 16 3.1 16 2C16 0.9 15.1 0 14 0ZM8 0C6.9 0 6 0.9 6 2C6 3.1 6.9 4 8 4C9.1 4 10 3.1 10 2C10 0.9 9.1 0 8 0Z'
                  fill='#24A322'
                />
              </svg>
            </button>
            <Button border={true} className={styles['header__button-message']}>
              Написать
            </Button>
            <Button className={styles['header__button-invite']}>
              Пригласить
            </Button>
          </div>
        </div>

        <div className={styles.expert__items}>
          {/* left */}
          <div className={styles['expert__column-content']}>
            <div className={styles.content}>
              <div className={styles.content__top}>
                <div className={styles.content__box}>
                  <div className={styles.content__title}>
                    Дизайнер со стажем более 9 лет. Нестандартный подход к
                    работе, Знание Photoshop, Illustrator, Figma
                  </div>
                  <div className={styles.content__actions}>
                    <button className={styles['content__button-share']}>
                      <svg
                        xmlns='http://www.w3.org/2000/svg'
                        width='35'
                        height='35'
                        viewBox='0 0 35 35'
                        fill='none'
                      >
                        <path
                          d='M21.4246 27C20.7092 27 20.1011 26.7458 19.6004 26.2373C19.0996 25.7288 18.8492 25.1114 18.8492 24.3851C18.8492 24.2834 18.8591 24.1655 18.8788 24.0316C18.8986 23.8977 18.9282 23.7771 18.9676 23.67L12.3959 19.8C12.164 20.045 11.8878 20.2412 11.5671 20.3888C11.2464 20.5363 10.9158 20.61 10.5754 20.61C9.86001 20.61 9.25193 20.3563 8.75115 19.8488C8.25038 19.3412 8 18.725 8 18C8 17.275 8.25038 16.6588 8.75115 16.1512C9.25193 15.6437 9.86001 15.39 10.5754 15.39C10.9158 15.39 11.2414 15.4562 11.5523 15.5887C11.8631 15.7213 12.1443 15.91 12.3959 16.155L18.9676 12.315C18.9282 12.2143 18.8986 12.101 18.8788 11.9751C18.8591 11.8492 18.8492 11.7275 18.8492 11.61C18.8492 10.885 19.0996 10.2688 19.6004 9.76124C20.1011 9.25375 20.7092 9 21.4246 9C22.14 9 22.7481 9.25375 23.2488 9.76124C23.7496 10.2688 24 10.885 24 11.61C24 12.335 23.7496 12.9512 23.2488 13.4587C22.7481 13.9662 22.14 14.22 21.4246 14.22C21.0807 14.22 20.7517 14.1612 20.4377 14.0437C20.1237 13.9262 19.8507 13.745 19.6189 13.5L13.0472 17.25C13.0768 17.36 13.1014 17.4862 13.1212 17.6288C13.1409 17.7713 13.1508 17.8962 13.1508 18.0036C13.1508 18.111 13.1409 18.2223 13.1212 18.3374C13.1014 18.4525 13.0768 18.565 13.0472 18.675L19.6189 22.485C19.8507 22.27 20.1172 22.0988 20.4181 21.9713C20.7191 21.8438 21.0546 21.78 21.4246 21.78C22.14 21.78 22.7481 22.0338 23.2488 22.5413C23.7496 23.0488 24 23.665 24 24.39C24 25.115 23.7496 25.7312 23.2488 26.2388C22.7481 26.7463 22.14 27 21.4246 27ZM21.4251 12.72C21.7356 12.72 21.9957 12.6136 22.2054 12.4007C22.415 12.1879 22.5199 11.9241 22.5199 11.6095C22.5199 11.2948 22.4149 11.0312 22.2048 10.8187C21.9948 10.6062 21.7346 10.5 21.4241 10.5C21.1136 10.5 20.8535 10.6064 20.6438 10.8193C20.4342 11.0321 20.3293 11.2959 20.3293 11.6105C20.3293 11.9252 20.4343 12.1888 20.6444 12.4013C20.8544 12.6137 21.1147 12.72 21.4251 12.72ZM10.5759 19.11C10.8864 19.11 11.1465 19.0036 11.3562 18.7907C11.5658 18.5779 11.6707 18.3141 11.6707 17.9995C11.6707 17.6848 11.5657 17.4212 11.3556 17.2087C11.1456 16.9962 10.8853 16.89 10.5749 16.89C10.2644 16.89 10.0043 16.9964 9.79463 17.2093C9.58494 17.4221 9.4801 17.6859 9.4801 18.0005C9.4801 18.3152 9.58511 18.5788 9.79514 18.7913C10.0052 19.0038 10.2654 19.11 10.5759 19.11ZM21.4251 25.5C21.7356 25.5 21.9957 25.3936 22.2054 25.1807C22.415 24.9679 22.5199 24.7041 22.5199 24.3895C22.5199 24.0748 22.4149 23.8112 22.2048 23.5987C21.9948 23.3863 21.7346 23.28 21.4241 23.28C21.1136 23.28 20.8535 23.3864 20.6438 23.5993C20.4342 23.8121 20.3293 24.0759 20.3293 24.3905C20.3293 24.7052 20.4343 24.9688 20.6444 25.1813C20.8544 25.3938 21.1147 25.5 21.4251 25.5Z'
                          fill='#24A322'
                        />
                      </svg>
                    </button>
                    <button className={styles['content__button-favorite']}>
                      <svg
                        xmlns='http://www.w3.org/2000/svg'
                        width='35'
                        height='35'
                        viewBox='0 0 35 35'
                        fill='none'
                      >
                        <path
                          d='M18 26C17.823 26 17.6429 25.9682 17.4596 25.9045C17.2762 25.8409 17.115 25.7391 16.976 25.5991L15.6675 24.3963C13.8975 22.7625 12.3438 21.185 11.0063 19.6637C9.66875 18.1424 9 16.5249 9 14.8112C9 13.4408 9.46 12.2963 10.38 11.3778C11.3 10.4593 12.44 10 13.8 10C14.575 10 15.33 10.1786 16.065 10.5358C16.8 10.8931 17.445 11.4489 18 12.2033C18.605 11.4489 19.26 10.8931 19.965 10.5358C20.67 10.1786 21.415 10 22.2 10C23.56 10 24.7 10.4593 25.62 11.3778C26.54 12.2963 27 13.4408 27 14.8112C27 16.5249 26.3325 18.1436 24.9975 19.6674C23.6625 21.1913 22.105 22.77 20.325 24.4037L19.02 25.6028C18.8825 25.7415 18.7231 25.8424 18.5419 25.9054C18.3606 25.9685 18.18 26 18 26ZM17.325 13.792C16.91 13.0976 16.4 12.5418 15.795 12.1246C15.19 11.7074 14.525 11.4988 13.8 11.4988C12.84 11.4988 12.05 11.8111 11.43 12.4356C10.81 13.0601 10.5 13.8541 10.5 14.8177C10.5 15.6527 10.7869 16.5344 11.3607 17.4627C11.9345 18.391 12.6208 19.2916 13.4195 20.1644C14.2181 21.0372 15.0437 21.8507 15.8963 22.6052C16.7487 23.3596 17.45 23.9891 18 24.4937C18.55 23.9991 19.2513 23.3721 20.1038 22.6126C20.9563 21.8532 21.7813 21.0339 22.5788 20.1546C23.3763 19.2753 24.0625 18.3712 24.6375 17.4425C25.2125 16.5138 25.5 15.6367 25.5 14.8112C25.5 13.852 25.1875 13.0601 24.5625 12.4356C23.9375 11.8111 23.15 11.4988 22.2 11.4988C21.465 11.4988 20.7975 11.7049 20.1975 12.1171C19.5975 12.5293 19.08 13.0876 18.645 13.792C18.56 13.9219 18.4625 14.0169 18.3525 14.0768C18.2425 14.1368 18.12 14.1667 17.985 14.1667C17.85 14.1667 17.725 14.1368 17.61 14.0768C17.495 14.0169 17.4 13.9219 17.325 13.792Z'
                          fill='#24A322'
                        />
                      </svg>
                    </button>
                  </div>
                </div>
                <p className={styles.content__text}>
                  Специализируюсь на проектировании и дизайне сайтов со сложным
                  и нестандартным функционалом (сервисы, порталы, крупные
                  интернет-магазины и тп). Помимо основной работы занимаюсь
                  обучением дизайну сайтов (лендинг, визитка, магазин,
                  проектирование интерфейсов, логика, юзабилити, Figma). 2023 г.
                  - спикер на Фриланс-форуме "Цифровые воротнички". Выступала с
                  докладом "Специфика работы с иностранными заказчиками"...
                </p>
              </div>

              <div className='border-t border-[#D9D9D9] pt-[27px]'>
                <div className='mb-[35px]'>
                  <div className='text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack [&:not(:last-child)]:mb-5'>
                    Отзывы <span>(127)</span>
                  </div>
                  <div className='flex items-center'>
                    <div className='w-1/3'>
                      <div className={styles.raiting}>
                        <div className={styles.rating__progress}>
                          <div className={styles['rating__progress-value']}>
                            <p className={styles['rating__rating-value']}>
                              5.0
                            </p>
                            <div className={styles.progress}>
                              <div className={styles.bar}></div>
                            </div>
                            <p className={`${styles['rating__rating-value']}`}>
                              (32)
                            </p>
                          </div>
                        </div>
                        <div className={styles.rating__progress}>
                          <div className={styles['rating__progress-value']}>
                            <p className={styles['rating__rating-value']}>
                              4.0
                            </p>
                            <div className={styles.progress}>
                              <div className={styles.bar}></div>
                            </div>
                            <p
                              className={`${styles['rating__rating-value']} ${styles['rating__rating-value_grey']}`}
                            >
                              (0)
                            </p>
                          </div>
                        </div>
                        <div className={styles.rating__progress}>
                          <div className={styles['rating__progress-value']}>
                            <p className={styles['rating__rating-value']}>
                              3.0
                            </p>
                            <div className={styles.progress}>
                              <div className={styles.bar}></div>
                            </div>
                            <p
                              className={`${styles['rating__rating-value']} ${styles['rating__rating-value_grey']}`}
                            >
                              (0)
                            </p>
                          </div>
                        </div>
                        <div className={styles.rating__progress}>
                          <div className={styles['rating__progress-value']}>
                            <p className={styles['rating__rating-value']}>
                              2.0
                            </p>
                            <div className={styles.progress}>
                              <div className={styles.bar}></div>
                            </div>
                            <p
                              className={`${styles['rating__rating-value']} ${styles['rating__rating-value_grey']}`}
                            >
                              (0)
                            </p>
                          </div>
                        </div>
                        <div className={styles.rating__progress}>
                          <div className={styles['rating__progress-value']}>
                            <p className={styles['rating__rating-value']}>
                              1.0
                            </p>
                            <div className={styles.progress}>
                              <div className={styles.bar}></div>
                            </div>
                            <p
                              className={`${styles['rating__rating-value']} ${styles['rating__rating-value_grey']}`}
                            >
                              (0)
                            </p>
                          </div>
                        </div>
                      </div>
                    </div>
                    <div className='flex-auto'>
                      <div className='mb-2.5 flex items-start'>
                        <CommentRating initialValue={5} maxRating={5} />
                        <span className='ml-2.5 text-17 font-medium tracking-[-0.68px] text-fontBlack'>
                          5.0
                        </span>
                      </div>
                      <div>
                        <div className='mb-[9px] text-13 leading-[1.23] tracking-[-0.52px] text-fontGrey'>
                          32 отзыва
                        </div>
                        <div className='flex gap-x-8'>
                          <div className='w-[39.8%]'>
                            <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                              <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                Качество
                              </span>
                              <div className='flex items-start gap-x-[3px]'>
                                <svg
                                  xmlns='http://www.w3.org/2000/svg'
                                  width='12'
                                  height='12'
                                  viewBox='0 0 12 12'
                                  fill='none'
                                >
                                  <path
                                    d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                    fill='#24A322'
                                  />
                                </svg>
                                <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                  5.0
                                </span>
                              </div>
                            </div>
                            <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                              <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                Соблюдение сроков
                              </span>
                              <div className='flex items-start gap-x-[3px]'>
                                <svg
                                  xmlns='http://www.w3.org/2000/svg'
                                  width='12'
                                  height='12'
                                  viewBox='0 0 12 12'
                                  fill='none'
                                >
                                  <path
                                    d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                    fill='#24A322'
                                  />
                                </svg>
                                <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                  5.0
                                </span>
                              </div>
                            </div>
                            <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                              <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                Профессионализм
                              </span>
                              <div className='flex items-start gap-x-[3px]'>
                                <svg
                                  xmlns='http://www.w3.org/2000/svg'
                                  width='12'
                                  height='12'
                                  viewBox='0 0 12 12'
                                  fill='none'
                                >
                                  <path
                                    d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                    fill='#24A322'
                                  />
                                </svg>
                                <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                  5.0
                                </span>
                              </div>
                            </div>
                          </div>
                          <div className='w-[39.8%]'>
                            <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                              <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                Доступность
                              </span>
                              <div className='flex items-start gap-x-[3px]'>
                                <svg
                                  xmlns='http://www.w3.org/2000/svg'
                                  width='12'
                                  height='12'
                                  viewBox='0 0 12 12'
                                  fill='none'
                                >
                                  <path
                                    d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                    fill='#24A322'
                                  />
                                </svg>
                                <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                  5.0
                                </span>
                              </div>
                            </div>
                            <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                              <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                Этичность
                              </span>
                              <div className='flex items-start gap-x-[3px]'>
                                <svg
                                  xmlns='http://www.w3.org/2000/svg'
                                  width='12'
                                  height='12'
                                  viewBox='0 0 12 12'
                                  fill='none'
                                >
                                  <path
                                    d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                    fill='#24A322'
                                  />
                                </svg>
                                <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                  5.0
                                </span>
                              </div>
                            </div>
                            <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                              <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                Дружелюбность
                              </span>
                              <div className='flex items-start gap-x-[3px]'>
                                <svg
                                  xmlns='http://www.w3.org/2000/svg'
                                  width='12'
                                  height='12'
                                  viewBox='0 0 12 12'
                                  fill='none'
                                >
                                  <path
                                    d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                    fill='#24A322'
                                  />
                                </svg>
                                <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                  5.0
                                </span>
                              </div>
                            </div>
                          </div>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>

                <div className=''>
                  {[...Array(5)].map((_, index) => {
                    return (
                      <Comment key={index} initialValue={3} maxRating={4} />
                    )
                  })}
                </div>
              </div>

              <div
                className={`${styles.more} border-t border-[#D9D9D9] py-[27px]`}
              >
                <div className={styles.more__content}>
                  <div className={styles.more__title}>
                    Дополнительная информация
                  </div>
                  <div className={styles.more__subtitle}>
                    Прошел что-то гениальное
                  </div>
                  <div className={styles.more__text}>
                    Как принято считать, сторонники тоталитаризма в науке
                    своевременно верифицированы. Сложно сказать, почему базовые
                    сценарии поведения пользователей формируют глобальную
                    экономическую сеть и при этом — объявлены нарушающими
                    общечеловеческие нормы этики и морали.
                  </div>
                </div>
              </div>

              <div className='border-t border-[#D9D9D9] py-7'>
                <div className='mb-[22px] text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                  Навыки
                </div>
                <div className='flex flex-wrap items-center gap-2.5'>
                  {[...Array(16)].map((item, index) => {
                    return (
                      <div
                        key={index}
                        className='rounded-[15px]  bg-[#f2f2f7] px-[13px] text-12 leading-[2.5] tracking-[-0.48px] text-fontBlack'
                      >
                        Adobe photoshop
                      </div>
                    )
                  })}
                </div>
              </div>
            </div>
          </div>

          {/* right */}
          <div className={styles['expert__column-info']}>
            <div className='py-[21px] pl-[30px]'>
              <div className='pb-[26px]'>
                <div className='mb-[15px] text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                  Специализация:
                </div>
                <div className='mb-3 text-15 font-normal leading-[1.06] tracking-[-0.6px] text-fontBlack'>
                  Веб-дизайн
                </div>
                <p className='mb-3 text-15 font-normal leading-[1.06] tracking-[-0.6px] text-fontGrey'>
                  Технические переводы
                </p>
                <p className='text-15 font-normal leading-[1.06] tracking-[-0.6px] text-fontGrey'>
                  UI / UX дизайн
                </p>
              </div>
              <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                <div className='mb-3 text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                  Видеопрезентация:
                </div>
                <div className='h-[128px] w-[227px] rounded-[15px] bg-[#D9D9D9]'></div>
              </div>
              <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                <div className='mb-[18px] text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                  Верификация:
                </div>
                <div className=''>
                  <div className='mb-3 flex items-center gap-x-[7px] text-15 leading-[1.06] tracking-[-0.6px] text-fontGrey'>
                    Телефон
                    <div className='h-[14px] w-[15px] text-[#039DF7]'>
                      <svg
                        className='h-full w-full'
                        xmlns='http://www.w3.org/2000/svg'
                        viewBox='0 0 15 14'
                        fill='none'
                      >
                        <path
                          d='M6.76759 7.64451L5.62359 6.49738C5.50659 6.37587 5.36315 6.31511 5.19327 6.31511C5.0234 6.31511 4.87469 6.37267 4.74715 6.48779C4.62252 6.61107 4.5602 6.75578 4.5602 6.9219C4.5602 7.08803 4.62252 7.23184 4.74715 7.35335L6.30824 8.86402C6.43819 8.99248 6.5913 9.05671 6.76759 9.05671C6.9439 9.05671 7.09702 8.99248 7.22696 8.86402L10.2528 5.92538C10.3728 5.81027 10.432 5.67018 10.4305 5.5051C10.4291 5.34002 10.366 5.19903 10.2414 5.08213C10.1215 4.97446 9.97851 4.92177 9.81245 4.92408C9.64639 4.92638 9.50813 4.98226 9.39768 5.09172L6.76759 7.64451ZM4.84306 13.6772L3.81126 11.9614L1.78061 11.55C1.6194 11.5204 1.48732 11.4376 1.38437 11.3016C1.28142 11.1656 1.24139 11.0186 1.26428 10.8606L1.48743 8.91022L0.167914 7.4175C0.0559713 7.30198 0 7.16281 0 7C0 6.83719 0.0559713 6.69802 0.167914 6.5825L1.48743 5.10093L1.26428 3.15058C1.24139 2.99253 1.28142 2.84552 1.38437 2.70956C1.48732 2.57357 1.6194 2.4899 1.78061 2.45855L3.81126 2.04977L4.84306 0.322769C4.92847 0.184937 5.04965 0.089223 5.20659 0.0356296C5.36353 -0.017975 5.51978 -0.0110242 5.67535 0.0564807L7.5 0.862875L9.32465 0.0564807C9.48022 -0.00923928 9.63647 -0.0176063 9.79341 0.0313797C9.95035 0.0803657 10.0715 0.173774 10.1569 0.311607L11.2002 2.04977L13.2194 2.45855C13.3806 2.4899 13.5127 2.57357 13.6156 2.70956C13.7186 2.84552 13.7586 2.99253 13.7357 3.15058L13.5126 5.10093L14.8321 6.5825C14.944 6.69802 15 6.83719 15 7C15 7.16281 14.944 7.30198 14.8321 7.4175L13.5126 8.91022L13.7357 10.8606C13.7586 11.0186 13.7186 11.1656 13.6156 11.3016C13.5127 11.4376 13.3806 11.5204 13.2194 11.55L11.2002 11.9614L10.1569 13.6884C10.0715 13.8262 9.95035 13.9196 9.79341 13.9686C9.63647 14.0176 9.48022 14.0092 9.32465 13.9435L7.5 13.1371L5.67535 13.9435C5.51978 14.0092 5.36353 14.0157 5.20659 13.963C5.04965 13.9103 4.92847 13.8151 4.84306 13.6772Z'
                          fill='currentColor'
                        />
                      </svg>
                    </div>
                  </div>
                </div>
                <div className=''>
                  <div className='mb-3 flex items-center gap-x-[7px] text-15 leading-[1.06] tracking-[-0.6px] text-fontGrey'>
                    Email
                    <div className='h-[14px] w-[15px] text-[#039DF7]'>
                      <svg
                        className='h-full w-full'
                        xmlns='http://www.w3.org/2000/svg'
                        viewBox='0 0 15 14'
                        fill='none'
                      >
                        <path
                          d='M6.76759 7.64451L5.62359 6.49738C5.50659 6.37587 5.36315 6.31511 5.19327 6.31511C5.0234 6.31511 4.87469 6.37267 4.74715 6.48779C4.62252 6.61107 4.5602 6.75578 4.5602 6.9219C4.5602 7.08803 4.62252 7.23184 4.74715 7.35335L6.30824 8.86402C6.43819 8.99248 6.5913 9.05671 6.76759 9.05671C6.9439 9.05671 7.09702 8.99248 7.22696 8.86402L10.2528 5.92538C10.3728 5.81027 10.432 5.67018 10.4305 5.5051C10.4291 5.34002 10.366 5.19903 10.2414 5.08213C10.1215 4.97446 9.97851 4.92177 9.81245 4.92408C9.64639 4.92638 9.50813 4.98226 9.39768 5.09172L6.76759 7.64451ZM4.84306 13.6772L3.81126 11.9614L1.78061 11.55C1.6194 11.5204 1.48732 11.4376 1.38437 11.3016C1.28142 11.1656 1.24139 11.0186 1.26428 10.8606L1.48743 8.91022L0.167914 7.4175C0.0559713 7.30198 0 7.16281 0 7C0 6.83719 0.0559713 6.69802 0.167914 6.5825L1.48743 5.10093L1.26428 3.15058C1.24139 2.99253 1.28142 2.84552 1.38437 2.70956C1.48732 2.57357 1.6194 2.4899 1.78061 2.45855L3.81126 2.04977L4.84306 0.322769C4.92847 0.184937 5.04965 0.089223 5.20659 0.0356296C5.36353 -0.017975 5.51978 -0.0110242 5.67535 0.0564807L7.5 0.862875L9.32465 0.0564807C9.48022 -0.00923928 9.63647 -0.0176063 9.79341 0.0313797C9.95035 0.0803657 10.0715 0.173774 10.1569 0.311607L11.2002 2.04977L13.2194 2.45855C13.3806 2.4899 13.5127 2.57357 13.6156 2.70956C13.7186 2.84552 13.7586 2.99253 13.7357 3.15058L13.5126 5.10093L14.8321 6.5825C14.944 6.69802 15 6.83719 15 7C15 7.16281 14.944 7.30198 14.8321 7.4175L13.5126 8.91022L13.7357 10.8606C13.7586 11.0186 13.7186 11.1656 13.6156 11.3016C13.5127 11.4376 13.3806 11.5204 13.2194 11.55L11.2002 11.9614L10.1569 13.6884C10.0715 13.8262 9.95035 13.9196 9.79341 13.9686C9.63647 14.0176 9.48022 14.0092 9.32465 13.9435L7.5 13.1371L5.67535 13.9435C5.51978 14.0092 5.36353 14.0157 5.20659 13.963C5.04965 13.9103 4.92847 13.8151 4.84306 13.6772Z'
                          fill='currentColor'
                        />
                      </svg>
                    </div>
                  </div>
                </div>
                <div className=''>
                  <div className='mb-3 flex items-center gap-x-[7px] text-15 leading-[1.06] tracking-[-0.6px] text-fontGrey'>
                    Оплата
                    <div className='h-[14px] w-[15px] text-[#039DF7]'>
                      <svg
                        className='h-full w-full'
                        xmlns='http://www.w3.org/2000/svg'
                        viewBox='0 0 15 14'
                        fill='none'
                      >
                        <path
                          d='M6.76759 7.64451L5.62359 6.49738C5.50659 6.37587 5.36315 6.31511 5.19327 6.31511C5.0234 6.31511 4.87469 6.37267 4.74715 6.48779C4.62252 6.61107 4.5602 6.75578 4.5602 6.9219C4.5602 7.08803 4.62252 7.23184 4.74715 7.35335L6.30824 8.86402C6.43819 8.99248 6.5913 9.05671 6.76759 9.05671C6.9439 9.05671 7.09702 8.99248 7.22696 8.86402L10.2528 5.92538C10.3728 5.81027 10.432 5.67018 10.4305 5.5051C10.4291 5.34002 10.366 5.19903 10.2414 5.08213C10.1215 4.97446 9.97851 4.92177 9.81245 4.92408C9.64639 4.92638 9.50813 4.98226 9.39768 5.09172L6.76759 7.64451ZM4.84306 13.6772L3.81126 11.9614L1.78061 11.55C1.6194 11.5204 1.48732 11.4376 1.38437 11.3016C1.28142 11.1656 1.24139 11.0186 1.26428 10.8606L1.48743 8.91022L0.167914 7.4175C0.0559713 7.30198 0 7.16281 0 7C0 6.83719 0.0559713 6.69802 0.167914 6.5825L1.48743 5.10093L1.26428 3.15058C1.24139 2.99253 1.28142 2.84552 1.38437 2.70956C1.48732 2.57357 1.6194 2.4899 1.78061 2.45855L3.81126 2.04977L4.84306 0.322769C4.92847 0.184937 5.04965 0.089223 5.20659 0.0356296C5.36353 -0.017975 5.51978 -0.0110242 5.67535 0.0564807L7.5 0.862875L9.32465 0.0564807C9.48022 -0.00923928 9.63647 -0.0176063 9.79341 0.0313797C9.95035 0.0803657 10.0715 0.173774 10.1569 0.311607L11.2002 2.04977L13.2194 2.45855C13.3806 2.4899 13.5127 2.57357 13.6156 2.70956C13.7186 2.84552 13.7586 2.99253 13.7357 3.15058L13.5126 5.10093L14.8321 6.5825C14.944 6.69802 15 6.83719 15 7C15 7.16281 14.944 7.30198 14.8321 7.4175L13.5126 8.91022L13.7357 10.8606C13.7586 11.0186 13.7186 11.1656 13.6156 11.3016C13.5127 11.4376 13.3806 11.5204 13.2194 11.55L11.2002 11.9614L10.1569 13.6884C10.0715 13.8262 9.95035 13.9196 9.79341 13.9686C9.63647 14.0176 9.48022 14.0092 9.32465 13.9435L7.5 13.1371L5.67535 13.9435C5.51978 14.0092 5.36353 14.0157 5.20659 13.963C5.04965 13.9103 4.92847 13.8151 4.84306 13.6772Z'
                          fill='currentColor'
                        />
                      </svg>
                    </div>
                  </div>
                </div>
              </div>
              <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                <div className='mb-3 text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                  Языки:
                </div>
                <div className='text-15 leading-[1.86] tracking-[-0.3px] text-fontGrey'>
                  <strong className='text-fontBlack'>Русский:</strong> родной
                  язык
                </div>
                <div className='text-15 leading-[1.86] tracking-[-0.3px] text-fontGrey'>
                  <strong className='text-fontBlack'>Английский:</strong>{' '}
                  разговорный язык
                </div>
                <div className='text-15 leading-[1.86] tracking-[-0.3px] text-fontGrey'>
                  <strong className='text-fontBlack'>Китайский:</strong> базовый
                  язык
                </div>
                <div className='text-15 leading-[1.86] tracking-[-0.3px] text-fontGrey'>
                  <strong className='text-fontBlack'>Испанский:</strong> уровень
                  носителя
                </div>
              </div>
              <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                <div className='mb-4 text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                  Образование:
                </div>
                <div>
                  <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                    Программист-техник
                  </div>
                  <div className='mb-[17px] text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                    Курский Государственный Политехнический Колледж (КГПК) 2011
                    - 2015
                  </div>
                  <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                    Бакалавр Инженер-программист
                  </div>
                  <div className='text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                    Юго-западный Государственный Университет (ЮЗГУ) 2016 - 2020
                  </div>
                </div>
              </div>
              <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                <div className='mb-4 text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                  Период работы:
                </div>
                <div>
                  <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                    NF portal
                  </div>
                  <div className='mb-[17px] text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                    Курск, Россия Главный дизайнер 2018 - по настоящее время
                  </div>
                  <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                    Art-Hall
                  </div>
                  <div className='text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                    Курск, Россия Штатный дизайнер 2015 - 2018
                  </div>
                </div>
              </div>
              <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                <div className='mb-4 text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                  Сертификаты:
                </div>
                <div>
                  <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                    Дизайнер сайтов на Tilda
                  </div>
                  <div className='mb-[17px] text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                    Skillbox (14.07.2023) 1452 4451 4124
                  </div>
                  <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                    Дизайнер сайтов на Tilda
                  </div>
                  <div className='text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                    Skillbox (14.07.2023) 1452 4451 4124
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  )
}

export default ExpertModal
