import Comment from '@/components/CatalogComment/Comment'
import CommentRating from '@/components/CatalogComment/CommentRating'
import Button from '@/components/ui/Button'

import ActionsButton from './components/ActionsButton'
import styles from './page.module.scss'

const skills = [
  'Adobe photoshop',
  'Adobe photoshop',
  'Adobe photoshop',
  'Adobe illustrator',
  'Adobe illustrator',
  'Adobe illustrator',
  'Figma',
  'Figma',
  'Figma',
  'Digital Painting',
  'Digital Painting',
  'Digital Painting',
  'Adobe photoshop',
  'Adobe photoshop',
  'Adobe photoshop'
]

const page = () => {
  return (
    <div className='pb-[66px] pt-[29px]'>
      <div className='expert-detail__second-container pt-[27px]'>
        <div className='mb-[35px]'>
          <div className='text-12 font-medium uppercase leading-[3.00] tracking-[0.12px] text-fontBlack'>
            Для Заказчика
          </div>
          <h1 className='mb-[7px] font-secondFamily text-40 font-bold leading-[1.00] tracking-[-0.8px] text-fontBlack'>
            Каталог экспертов
          </h1>
          <div className='flex items-center gap-x-2'>
            <div className='flex items-center'>
              <span className='mr-[10px] text-12 font-medium tracking-[-0.48px] text-greenDark'>
                Главная
              </span>
              <svg
                xmlns='http://www.w3.org/2000/svg'
                width='5'
                height='8'
                viewBox='0 0 5 8'
                fill='none'
              >
                <path
                  d='M5 3.99411C5 4.07277 4.98608 4.14553 4.95824 4.21239C4.93039 4.27926 4.88218 4.34415 4.81364 4.40708L1.08611 7.82892C0.961872 7.94297 0.811916 8 0.636248 8C0.460579 8 0.310624 7.94297 0.186382 7.82892C0.0621272 7.71486 -1.85674e-08 7.57523 -2.57882e-08 7.41004C-3.30089e-08 7.24484 0.0621271 7.10522 0.186382 6.99117L3.45118 3.99411L0.186382 0.997045C0.0621269 0.882991 -3.17112e-07 0.745333 -3.24161e-07 0.584071C-3.31209e-07 0.42282 0.0621268 0.285162 0.186381 0.171097C0.310623 0.0570321 0.462719 -2.02261e-08 0.642668 -2.80919e-08C0.822617 -3.59577e-08 0.974718 0.0570321 1.09897 0.171097L4.81364 3.58113C4.88218 3.64406 4.93039 3.70896 4.95824 3.77582C4.98608 3.84268 5 3.91544 5 3.99411Z'
                  fill='#8E8E93'
                />
              </svg>
            </div>
            <div className='flex items-center'>
              <span className='mr-[10px] text-12 font-medium tracking-[-0.48px] text-fontGrey'>
                Найти гения
              </span>
            </div>
          </div>
        </div>

        <div className='rounded-[30px] border border-[#DBDBDB] pt-[42px]'>
          <div>
            <div className='flex pb-[37px] pl-[39px] pr-[30px]'>
              <div className='flex flex-auto items-start gap-x-[30px]'>
                <div className='flex h-[100px] w-[100px] flex-[0_0_100px] items-start'>
                  <img
                    className='h-[100px] w-[100px] rounded-[50%] object-cover'
                    src='/images/experts/user-card-mock.svg'
                    alt=''
                  />
                </div>
                <div>
                  <div className='mb-[7px] flex items-center gap-x-[6px]'>
                    <span className='text-22 leading-[0.90] tracking-[-0.88px] text-greenDark'>
                      Гений Г.
                    </span>
                    <div className='h-4 w-4 text-[#039DF7]'>
                      <svg
                        className='h-full w-full'
                        xmlns='http://www.w3.org/2000/svg'
                        width='16'
                        height='16'
                        viewBox='0 0 16 16'
                        fill='none'
                      >
                        <path
                          d='M7.21877 8.69055L5.9985 7.46148C5.8737 7.33129 5.72069 7.26619 5.53949 7.26619C5.35829 7.26619 5.19967 7.32786 5.06363 7.4512C4.93068 7.58329 4.86421 7.73833 4.86421 7.91632C4.86421 8.09431 4.93068 8.2484 5.06363 8.37859L6.72879 9.99716C6.8674 10.1348 7.03072 10.2036 7.21877 10.2036C7.40682 10.2036 7.57015 10.1348 7.70876 9.99716L10.9364 6.84862C11.0643 6.72529 11.1274 6.57519 11.1259 6.39832C11.1243 6.22145 11.0571 6.07039 10.9242 5.94514C10.7963 5.82977 10.6437 5.77333 10.4666 5.7758C10.2895 5.77826 10.142 5.83814 10.0242 5.95542L7.21877 8.69055ZM5.16593 15.1542L4.06535 13.3158L1.89931 12.875C1.72736 12.8432 1.58647 12.7545 1.47666 12.6089C1.36685 12.4632 1.32415 12.3057 1.34857 12.1363L1.5866 10.0467L0.179108 8.44732C0.0597027 8.32355 0 8.17444 0 8C0 7.82556 0.0597027 7.67645 0.179108 7.55268L1.5866 5.96528L1.34857 3.87562C1.32415 3.70628 1.36685 3.54878 1.47666 3.40309C1.58647 3.2574 1.72736 3.16776 1.89931 3.13416L4.06535 2.69618L5.16593 0.845824C5.25704 0.698147 5.38629 0.595596 5.55369 0.538175C5.7211 0.480741 5.88777 0.488188 6.0537 0.560515L8 1.42451L9.9463 0.560515C10.1122 0.490101 10.2789 0.481136 10.4463 0.533621C10.6137 0.586106 10.743 0.686187 10.8341 0.833864L11.9469 2.69618L14.1007 3.13416C14.2726 3.16776 14.4135 3.2574 14.5233 3.40309C14.6331 3.54878 14.6758 3.70628 14.6514 3.87562L14.4134 5.96528L15.8209 7.55268C15.9403 7.67645 16 7.82556 16 8C16 8.17444 15.9403 8.32355 15.8209 8.44732L14.4134 10.0467L14.6514 12.1363C14.6758 12.3057 14.6331 12.4632 14.5233 12.6089C14.4135 12.7545 14.2726 12.8432 14.1007 12.875L11.9469 13.3158L10.8341 15.1661C10.743 15.3138 10.6137 15.4139 10.4463 15.4664C10.2789 15.5189 10.1122 15.5099 9.9463 15.4395L8 14.5755L6.0537 15.4395C5.88777 15.5099 5.7211 15.5169 5.55369 15.4604C5.38629 15.4039 5.25704 15.3019 5.16593 15.1542Z'
                          fill='currentColor'
                        />
                      </svg>
                    </div>
                  </div>
                  <div className='mb-1 flex items-center gap-x-4'>
                    <span className='text-12 leading-[1.66] tracking-[-0.48px] text-fontGrey'>
                      Россия, Москва
                    </span>
                    <span className='text-13 tracking-[0.13px] text-fontGrey'>
                      <strong className='font-normal text-fontBlack'>
                        21:30 {''}
                      </strong>
                      местное время
                    </span>
                  </div>
                  <span className='mb-[15px] flex w-[98px] items-center gap-x-[2px] rounded-[50px] border border-blueLight px-[13px]'>
                    <div className='h-[11px] w-[11px]'>
                      <svg
                        className='h-full w-full text-[#039DF7]'
                        xmlns='http://www.w3.org/2000/svg'
                        width='11'
                        height='11'
                        viewBox='0 0 11 11'
                        fill='none'
                      >
                        <path
                          d='M0.596149 11C0.427236 11 0.285649 10.9404 0.17139 10.8213C0.0571298 10.7022 0 10.5586 0 10.3906C0 10.2225 0.0588943 10.0813 0.176683 9.9667C0.294471 9.85214 0.439101 9.79486 0.610573 9.79486H9.25C9.41891 9.79486 9.56049 9.85234 9.67476 9.96729C9.78902 10.0822 9.84615 10.2247 9.84615 10.3946C9.84615 10.5645 9.7873 10.7079 9.66959 10.8247C9.55188 10.9416 9.41042 11 9.2452 11H0.596149ZM8.6875 3.31776H9.8029V1.20514H8.6875V3.31776ZM2.46635 8.83457C1.77404 8.83457 1.1899 8.59726 0.713943 8.12265C0.237981 7.64803 0 7.0643 0 6.37147V1.35398C0 0.978723 0.132019 0.659242 0.396058 0.39554C0.660106 0.131847 0.980006 0 1.35576 0H3.18269L3.17788 1.82932L2.06458 2.72046C2.03755 2.74095 1.99519 2.82328 1.9375 2.96745V5.34691C1.9375 5.43783 1.97247 5.51768 2.04241 5.58647C2.11236 5.65525 2.1985 5.68965 2.30081 5.68965H4.70703C4.79977 5.68965 4.8822 5.65482 4.95432 5.58516C5.02643 5.5155 5.06249 5.43423 5.06249 5.34134V2.97337C5.06249 2.94689 5.02083 2.86322 4.9375 2.72238L3.83172 1.82932L3.83654 0H9.8029C10.1378 0 10.4211 0.118033 10.6526 0.354099C10.8842 0.590164 11 0.873846 11 1.20514V3.31776C11 3.65578 10.8842 3.94515 10.6526 4.18586C10.4211 4.42657 10.1378 4.54692 9.8029 4.54692H8.6875V6.37147C8.6875 7.0643 8.44792 7.64803 7.96876 8.12265C7.48958 8.59726 6.90705 8.83457 6.22115 8.83457H2.46635Z'
                          fill='currentColor'
                        />
                      </svg>
                    </div>
                    <span className='text-12 leading-[1.66] tracking-[-0.48px] text-blueLight'>
                      Свободен
                    </span>
                  </span>
                  <div className='flex flex-wrap items-center gap-[30px]'>
                    <span className='text-15 font-medium leading-[1.06] tracking-[-0.6px] text-fontBlack'>
                      1 500 ₽ / час
                    </span>
                    <span className='text-15 leading-[1.06] tracking-[-0.6px] text-fontBlack'>
                      <span className='font-medium'>78</span> завершенных
                      проектов
                    </span>
                    <div className='flex h-[17px] items-start gap-x-[6px]'>
                      <div className='h-[14px] w-[14px] text-greenDark'>
                        <svg
                          className='h-full w-full'
                          xmlns='http://www.w3.org/2000/svg'
                          width='14'
                          height='14'
                          viewBox='0 0 14 14'
                          fill='none'
                        >
                          <path
                            d='M7 11.6828L3.51263 13.8831C3.37675 13.9705 3.23543 14.0089 3.08868 13.9983C2.94193 13.9876 2.81232 13.9386 2.69984 13.8512C2.58736 13.7638 2.50245 13.652 2.44509 13.5159C2.38772 13.3797 2.37617 13.227 2.41045 13.0578L3.33269 8.9018L0.252428 6.09807C0.126006 5.98254 0.0481134 5.85166 0.0187502 5.70541C-0.010613 5.55917 -0.00548867 5.41656 0.0341232 5.27761C0.0716801 5.13866 0.145831 5.02215 0.256576 4.92808C0.367322 4.83401 0.505718 4.77797 0.671764 4.75994L4.74069 4.38806L6.31713 0.463871C6.38036 0.307091 6.47652 0.190581 6.60561 0.11434C6.73471 0.0381138 6.86617 0 7 0C7.13383 0 7.26529 0.0381138 7.39439 0.11434C7.52348 0.190581 7.61964 0.307091 7.68287 0.463871L9.25931 4.38806L13.3313 4.75994C13.4953 4.77797 13.6327 4.83401 13.7434 4.92808C13.8542 5.02215 13.9283 5.13866 13.9659 5.27761C14.0055 5.41656 14.0106 5.55917 13.9812 5.70541C13.9519 5.85166 13.874 5.98254 13.7476 6.09807L10.6673 8.9018L11.5896 13.0578C11.6238 13.227 11.6123 13.3797 11.5549 13.5159C11.4976 13.652 11.4126 13.7638 11.3002 13.8512C11.1877 13.9386 11.0581 13.9876 10.9113 13.9983C10.7646 14.0089 10.6233 13.9705 10.4874 13.8831L7 11.6828Z'
                            fill='currentColor'
                          />
                        </svg>
                      </div>
                      <span className='text-15 leading-[1.06] tracking-[-0.6px] text-fontBlack'>
                        <span className='font-medium'>5.0</span> (81 отзыв)
                      </span>
                    </div>
                    <div className='flex items-center gap-x-[8px]'>
                      <img
                        className='h-4 w-[18px]'
                        src='/images/experts/diamond-blue.svg'
                        alt=''
                      />
                      <span className='text-15 leading-[1.06] tracking-[-0.6px] text-fontBlack'>
                        Продвинутый
                      </span>
                    </div>
                  </div>
                </div>
              </div>
              <div className='flex-[0_0_295px]'>
                <ActionsButton />
              </div>
            </div>
          </div>

          <div className='border-t border-[#DBDBDB]'>
            <div className='grid grid-cols-[1fr_25.68%]'>
              {/* left */}
              <div className='px-[40px]'>
                <div className='pb-[37px] pt-[33px]'>
                  <div className='mb-[26px] flex justify-between gap-x-2'>
                    <div className='max-w-[548px] text-22 font-medium leading-[1.18] tracking-[-0.88px] text-fontBlack'>
                      Дизайнер со стажем более 9 лет. Нестандартный подход к
                      работе, Знание Photoshop, Illustrator, Figma
                    </div>
                    <div className='flex items-center gap-x-2.5'>
                      <button className='flex h-[35px] w-[35px] flex-[0_0_35px] items-center justify-center rounded-[50%] border-[2px]  border-[#D1D1D6]'>
                        <svg
                          className='h-[35px] w-[35px] text-greenDark'
                          xmlns='http://www.w3.org/2000/svg'
                          width='35'
                          height='35'
                          viewBox='0 0 35 35'
                          fill='none'
                        >
                          <path
                            d='M21.4246 27C20.7092 27 20.1011 26.7458 19.6004 26.2373C19.0996 25.7288 18.8492 25.1114 18.8492 24.3851C18.8492 24.2834 18.8591 24.1655 18.8788 24.0316C18.8986 23.8977 18.9282 23.7771 18.9676 23.67L12.3959 19.8C12.164 20.045 11.8878 20.2412 11.5671 20.3888C11.2464 20.5363 10.9158 20.61 10.5754 20.61C9.86001 20.61 9.25193 20.3563 8.75115 19.8488C8.25038 19.3412 8 18.725 8 18C8 17.275 8.25038 16.6588 8.75115 16.1512C9.25193 15.6437 9.86001 15.39 10.5754 15.39C10.9158 15.39 11.2414 15.4562 11.5523 15.5887C11.8631 15.7213 12.1443 15.91 12.3959 16.155L18.9676 12.315C18.9282 12.2143 18.8986 12.101 18.8788 11.9751C18.8591 11.8492 18.8492 11.7275 18.8492 11.61C18.8492 10.885 19.0996 10.2688 19.6004 9.76124C20.1011 9.25375 20.7092 9 21.4246 9C22.14 9 22.7481 9.25375 23.2488 9.76124C23.7496 10.2688 24 10.885 24 11.61C24 12.335 23.7496 12.9512 23.2488 13.4587C22.7481 13.9662 22.14 14.22 21.4246 14.22C21.0807 14.22 20.7517 14.1612 20.4377 14.0437C20.1237 13.9262 19.8507 13.745 19.6189 13.5L13.0472 17.25C13.0768 17.36 13.1014 17.4862 13.1212 17.6288C13.1409 17.7713 13.1508 17.8962 13.1508 18.0036C13.1508 18.111 13.1409 18.2223 13.1212 18.3374C13.1014 18.4525 13.0768 18.565 13.0472 18.675L19.6189 22.485C19.8507 22.27 20.1172 22.0988 20.4181 21.9713C20.7191 21.8438 21.0546 21.78 21.4246 21.78C22.14 21.78 22.7481 22.0338 23.2488 22.5413C23.7496 23.0488 24 23.665 24 24.39C24 25.115 23.7496 25.7312 23.2488 26.2388C22.7481 26.7463 22.14 27 21.4246 27ZM21.4251 12.72C21.7356 12.72 21.9957 12.6136 22.2054 12.4007C22.415 12.1879 22.5199 11.9241 22.5199 11.6095C22.5199 11.2948 22.4149 11.0312 22.2048 10.8187C21.9948 10.6062 21.7346 10.5 21.4241 10.5C21.1136 10.5 20.8535 10.6064 20.6438 10.8193C20.4342 11.0321 20.3293 11.2959 20.3293 11.6105C20.3293 11.9252 20.4343 12.1888 20.6444 12.4013C20.8544 12.6137 21.1147 12.72 21.4251 12.72ZM10.5759 19.11C10.8864 19.11 11.1465 19.0036 11.3562 18.7907C11.5658 18.5779 11.6707 18.3141 11.6707 17.9995C11.6707 17.6848 11.5657 17.4212 11.3556 17.2087C11.1456 16.9962 10.8853 16.89 10.5749 16.89C10.2644 16.89 10.0043 16.9964 9.79463 17.2093C9.58494 17.4221 9.4801 17.6859 9.4801 18.0005C9.4801 18.3152 9.58511 18.5788 9.79514 18.7913C10.0052 19.0038 10.2654 19.11 10.5759 19.11ZM21.4251 25.5C21.7356 25.5 21.9957 25.3936 22.2054 25.1807C22.415 24.9679 22.5199 24.7041 22.5199 24.3895C22.5199 24.0748 22.4149 23.8112 22.2048 23.5987C21.9948 23.3863 21.7346 23.28 21.4241 23.28C21.1136 23.28 20.8535 23.3864 20.6438 23.5993C20.4342 23.8121 20.3293 24.0759 20.3293 24.3905C20.3293 24.7052 20.4343 24.9688 20.6444 25.1813C20.8544 25.3938 21.1147 25.5 21.4251 25.5Z'
                            fill='currentColor'
                          />
                        </svg>
                      </button>
                      <button className='flex h-[35px] w-[35px] flex-[0_0_35px] items-center justify-center rounded-[50%] border-[2px]  border-[#D1D1D6]'>
                        <div className='h-[16px] w-[18px] text-greenDark'>
                          <svg
                            className='h-full w-full'
                            xmlns='http://www.w3.org/2000/svg'
                            width='18'
                            height='16'
                            viewBox='0 0 18 16'
                            fill='none'
                          >
                            <path
                              d='M9 16C8.82301 16 8.64287 15.9682 8.45955 15.9045C8.27624 15.8409 8.11505 15.7391 7.97598 15.5991L6.66752 14.3963C4.89752 12.7625 3.34376 11.185 2.00626 9.66369C0.668753 8.14238 0 6.52489 0 4.81124C0 3.44077 0.459997 2.29628 1.37999 1.37777C2.3 0.459256 3.44 0 4.79999 0C5.575 0 6.33 0.178608 7.065 0.535824C7.8 0.893055 8.445 1.44887 9 2.20328C9.60501 1.44887 10.26 0.893055 10.965 0.535824C11.67 0.178608 12.415 0 13.2 0C14.56 0 15.7 0.459256 16.62 1.37777C17.54 2.29628 18 3.44077 18 4.81124C18 6.52489 17.3325 8.14363 15.9975 9.66744C14.6625 11.1913 13.105 12.77 11.325 14.4037L10.02 15.6028C9.88249 15.7415 9.72311 15.8424 9.54187 15.9054C9.36062 15.9685 9.18 16 9 16ZM8.325 3.79204C7.91001 3.09758 7.40001 2.54176 6.795 2.12459C6.19001 1.70741 5.525 1.49881 4.79999 1.49881C3.83999 1.49881 3.05 1.81107 2.43 2.43559C1.80999 3.06011 1.49999 3.85413 1.49999 4.81767C1.49999 5.65273 1.7869 6.53441 2.36072 7.46273C2.93453 8.39104 3.62078 9.29159 4.41947 10.1644C5.21815 11.0372 6.04374 11.8507 6.89625 12.6052C7.74875 13.3596 8.44999 13.9891 9 14.4937C9.55001 13.9991 10.2513 13.3721 11.1038 12.6126C11.9563 11.8532 12.7813 11.0339 13.5788 10.1546C14.3763 9.27525 15.0625 8.37124 15.6375 7.44254C16.2125 6.51385 16.5 5.63675 16.5 4.81124C16.5 3.85199 16.1875 3.06011 15.5625 2.43559C14.9375 1.81107 14.15 1.49881 13.2 1.49881C12.465 1.49881 11.7975 1.7049 11.1975 2.11708C10.5975 2.52927 10.08 3.08759 9.64499 3.79204C9.56 3.92193 9.4625 4.01685 9.35251 4.07681C9.2425 4.13676 9.11999 4.16674 8.98499 4.16674C8.84999 4.16674 8.725 4.13676 8.61001 4.07681C8.495 4.01685 8.4 3.92193 8.325 3.79204Z'
                              fill='currentColor'
                            />
                          </svg>
                        </div>
                      </button>
                    </div>
                  </div>
                  <div className='max-w-[687px] text-15 leading-[1.33] tracking-[-0.3px] text-fontDarkGrey'>
                    Специализируюсь на проектировании и дизайне сайтов со
                    сложным и нестандартным функционалом (сервисы, порталы,
                    крупные интернет-магазины и тп). <br />
                    <div className='mb-6'></div>
                    Помимо основной работы занимаюсь обучением дизайну сайтов
                    (лендинг, визитка, магазин, проектирование интерфейсов,
                    логика, юзабилити, Figma). <br />
                    <div className='mb-6'></div>
                    2023 г. - спикер на Фриланс-форуме "Цифровые воротнички".
                    Выступала с докладом "Специфика работы с иностранными
                    заказчиками"...
                  </div>
                </div>

                <div className='border-t border-[#D9D9D9] pt-[27px]'>
                  <div>
                    <div className='mb-[35px]'>
                      <div className='text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack [&:not(:last-child)]:mb-5'>
                        Отзывы <span>(127)</span>
                      </div>
                      <div className='flex items-center'>
                        <div className='w-1/3'>
                          <div className={styles.raiting}>
                            <div className={styles.rating__progress}>
                              <div className={styles['rating__progress-value']}>
                                <p className={styles['rating__rating-value']}>
                                  5.0
                                </p>
                                <div className={styles.progress}>
                                  <div className={styles.bar}></div>
                                </div>
                                <p
                                  className={`${styles['rating__rating-value']}`}
                                >
                                  (32)
                                </p>
                              </div>
                            </div>
                            <div className={styles.rating__progress}>
                              <div className={styles['rating__progress-value']}>
                                <p className={styles['rating__rating-value']}>
                                  4.0
                                </p>
                                <div className={styles.progress}>
                                  <div className={styles.bar}></div>
                                </div>
                                <p
                                  className={`${styles['rating__rating-value']} ${styles['rating__rating-value_grey']}`}
                                >
                                  (0)
                                </p>
                              </div>
                            </div>
                            <div className={styles.rating__progress}>
                              <div className={styles['rating__progress-value']}>
                                <p className={styles['rating__rating-value']}>
                                  3.0
                                </p>
                                <div className={styles.progress}>
                                  <div className={styles.bar}></div>
                                </div>
                                <p
                                  className={`${styles['rating__rating-value']} ${styles['rating__rating-value_grey']}`}
                                >
                                  (0)
                                </p>
                              </div>
                            </div>
                            <div className={styles.rating__progress}>
                              <div className={styles['rating__progress-value']}>
                                <p className={styles['rating__rating-value']}>
                                  2.0
                                </p>
                                <div className={styles.progress}>
                                  <div className={styles.bar}></div>
                                </div>
                                <p
                                  className={`${styles['rating__rating-value']} ${styles['rating__rating-value_grey']}`}
                                >
                                  (0)
                                </p>
                              </div>
                            </div>
                            <div className={styles.rating__progress}>
                              <div className={styles['rating__progress-value']}>
                                <p className={styles['rating__rating-value']}>
                                  1.0
                                </p>
                                <div className={styles.progress}>
                                  <div className={styles.bar}></div>
                                </div>
                                <p
                                  className={`${styles['rating__rating-value']} ${styles['rating__rating-value_grey']}`}
                                >
                                  (0)
                                </p>
                              </div>
                            </div>
                          </div>
                        </div>
                        <div className='flex-auto'>
                          <div className='mb-2.5 flex items-start'>
                            <CommentRating initialValue={5} maxRating={5} />
                            <span className='ml-2.5 text-17 font-medium tracking-[-0.68px] text-fontBlack'>
                              5.0
                            </span>
                          </div>
                          <div>
                            <div className='mb-[9px] text-13 leading-[1.23] tracking-[-0.52px] text-fontGrey'>
                              32 отзыва
                            </div>
                            <div className='flex gap-x-8'>
                              <div className='w-[39.8%]'>
                                <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                                  <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                    Качество
                                  </span>
                                  <div className='flex items-start gap-x-[3px]'>
                                    <svg
                                      xmlns='http://www.w3.org/2000/svg'
                                      width='12'
                                      height='12'
                                      viewBox='0 0 12 12'
                                      fill='none'
                                    >
                                      <path
                                        d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                        fill='#24A322'
                                      />
                                    </svg>
                                    <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                      5.0
                                    </span>
                                  </div>
                                </div>
                                <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                                  <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                    Соблюдение сроков
                                  </span>
                                  <div className='flex items-start gap-x-[3px]'>
                                    <svg
                                      xmlns='http://www.w3.org/2000/svg'
                                      width='12'
                                      height='12'
                                      viewBox='0 0 12 12'
                                      fill='none'
                                    >
                                      <path
                                        d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                        fill='#24A322'
                                      />
                                    </svg>
                                    <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                      5.0
                                    </span>
                                  </div>
                                </div>
                                <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                                  <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                    Профессионализм
                                  </span>
                                  <div className='flex items-start gap-x-[3px]'>
                                    <svg
                                      xmlns='http://www.w3.org/2000/svg'
                                      width='12'
                                      height='12'
                                      viewBox='0 0 12 12'
                                      fill='none'
                                    >
                                      <path
                                        d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                        fill='#24A322'
                                      />
                                    </svg>
                                    <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                      5.0
                                    </span>
                                  </div>
                                </div>
                              </div>
                              <div className='w-[39.8%]'>
                                <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                                  <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                    Доступность
                                  </span>
                                  <div className='flex items-start gap-x-[3px]'>
                                    <svg
                                      xmlns='http://www.w3.org/2000/svg'
                                      width='12'
                                      height='12'
                                      viewBox='0 0 12 12'
                                      fill='none'
                                    >
                                      <path
                                        d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                        fill='#24A322'
                                      />
                                    </svg>
                                    <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                      5.0
                                    </span>
                                  </div>
                                </div>
                                <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                                  <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                    Этичность
                                  </span>
                                  <div className='flex items-start gap-x-[3px]'>
                                    <svg
                                      xmlns='http://www.w3.org/2000/svg'
                                      width='12'
                                      height='12'
                                      viewBox='0 0 12 12'
                                      fill='none'
                                    >
                                      <path
                                        d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                        fill='#24A322'
                                      />
                                    </svg>
                                    <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                      5.0
                                    </span>
                                  </div>
                                </div>
                                <div className='flex items-center justify-between [&:not(:last-child)]:mb-2'>
                                  <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                    Дружелюбность
                                  </span>
                                  <div className='flex items-start gap-x-[3px]'>
                                    <svg
                                      xmlns='http://www.w3.org/2000/svg'
                                      width='12'
                                      height='12'
                                      viewBox='0 0 12 12'
                                      fill='none'
                                    >
                                      <path
                                        d='M6 10.0138L3.01083 11.8998C2.89436 11.9747 2.77323 12.0076 2.64744 11.9985C2.52165 11.9894 2.41056 11.9474 2.31415 11.8725C2.21774 11.7975 2.14495 11.7017 2.09579 11.585C2.04662 11.4683 2.03672 11.3375 2.0661 11.1924L2.85659 7.63011L0.216367 5.22692C0.108005 5.1279 0.04124 5.01571 0.0160716 4.89035C-0.00909685 4.765 -0.00470457 4.64277 0.0292484 4.52366C0.0614401 4.40457 0.124998 4.3047 0.219923 4.22407C0.314847 4.14344 0.433472 4.0954 0.575798 4.07995L4.06345 3.76119L5.41468 0.397604C5.46888 0.263221 5.5513 0.163355 5.66195 0.0980061C5.77261 0.032669 5.88529 0 6 0C6.11471 0 6.22739 0.032669 6.33805 0.0980061C6.4487 0.163355 6.53112 0.263221 6.58532 0.397604L7.93655 3.76119L11.4269 4.07995C11.5674 4.0954 11.6852 4.14344 11.7801 4.22407C11.875 4.3047 11.9386 4.40457 11.9708 4.52366C12.0047 4.64277 12.0091 4.765 11.9839 4.89035C11.9588 5.01571 11.892 5.1279 11.7836 5.22692L9.14341 7.63011L9.9339 11.1924C9.96328 11.3375 9.95338 11.4683 9.90421 11.585C9.85505 11.7017 9.78226 11.7975 9.68585 11.8725C9.58944 11.9474 9.47834 11.9894 9.35256 11.9985C9.22677 12.0076 9.10564 11.9747 8.98917 11.8998L6 10.0138Z'
                                        fill='#24A322'
                                      />
                                    </svg>
                                    <span className='text-13 leading-[1.23] tracking-[-0.52px] text-fontBlack'>
                                      5.0
                                    </span>
                                  </div>
                                </div>
                              </div>
                            </div>
                          </div>
                        </div>
                      </div>
                    </div>

                    <div className=''>
                      {[...Array(5)].map((_, index) => {
                        return (
                          <Comment key={index} initialValue={3} maxRating={4} />
                        )
                      })}
                    </div>
                  </div>
                </div>

                <div className='border-t border-[#DBDBDB] pb-[35px] pt-[27px]'>
                  <div className='mb-[25px] text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                    Дополнительная информация
                  </div>
                  <div>
                    <div className='mb-[9px] text-15 font-medium leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                      Прошел что-то гениальное
                    </div>
                    <p className='text-15 leading-[1.33] tracking-[-0.3px] text-fontDarkGrey'>
                      Как принято считать, сторонники тоталитаризма в науке
                      своевременно верифицированы. Сложно сказать, почему
                      базовые сценарии поведения пользователей формируют
                      глобальную экономическую сеть и при этом — объявлены
                      нарушающими общечеловеческие нормы этики и морали.
                    </p>
                  </div>
                </div>

                <div className='border-t border-[#D9D9D9] pb-[75px] pt-7'>
                  <div className='mb-[22px] text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                    Навыки
                  </div>
                  <div className='flex flex-wrap items-center gap-2.5'>
                    {skills.map((item, index) => {
                      return (
                        <div
                          key={index}
                          className='rounded-[15px]  bg-[#f2f2f7] px-[13px] text-12 leading-[2.5] tracking-[-0.48px] text-fontBlack'
                        >
                          {item}
                        </div>
                      )
                    })}
                  </div>
                </div>
              </div>

              {/* right */}
              <div className='border-l border-[#D9D9D9] px-[30px] py-[21px]'>
                <div className='pb-[26px]'>
                  <div className='mb-[15px] text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                    Специализация:
                  </div>
                  <div className='mb-3 text-15 font-normal leading-[1.06] tracking-[-0.6px] text-fontBlack'>
                    Веб-дизайн
                  </div>
                  <p className='mb-3 text-15 font-normal leading-[1.06] tracking-[-0.6px] text-fontGrey'>
                    Технические переводы
                  </p>
                  <p className='text-15 font-normal leading-[1.06] tracking-[-0.6px] text-fontGrey'>
                    UI / UX дизайн
                  </p>
                </div>
                <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                  <div className='mb-3 text-17 leading-[2.11] tracking-[0.17px] text-fontBlack'>
                    Видеопрезентация:
                  </div>
                  <div className='h-[128px] w-full rounded-[15px] bg-[#D9D9D9]'></div>
                </div>
                <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                  <div className='mb-[18px] text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                    Верификация:
                  </div>
                  <div className=''>
                    <div className='mb-3 flex items-center gap-x-[7px] text-15 leading-[1.06] tracking-[-0.6px] text-fontGrey'>
                      Телефон
                      <div className='h-[14px] w-[15px] text-[#039DF7]'>
                        <svg
                          className='h-full w-full'
                          xmlns='http://www.w3.org/2000/svg'
                          viewBox='0 0 15 14'
                          fill='none'
                        >
                          <path
                            d='M6.76759 7.64451L5.62359 6.49738C5.50659 6.37587 5.36315 6.31511 5.19327 6.31511C5.0234 6.31511 4.87469 6.37267 4.74715 6.48779C4.62252 6.61107 4.5602 6.75578 4.5602 6.9219C4.5602 7.08803 4.62252 7.23184 4.74715 7.35335L6.30824 8.86402C6.43819 8.99248 6.5913 9.05671 6.76759 9.05671C6.9439 9.05671 7.09702 8.99248 7.22696 8.86402L10.2528 5.92538C10.3728 5.81027 10.432 5.67018 10.4305 5.5051C10.4291 5.34002 10.366 5.19903 10.2414 5.08213C10.1215 4.97446 9.97851 4.92177 9.81245 4.92408C9.64639 4.92638 9.50813 4.98226 9.39768 5.09172L6.76759 7.64451ZM4.84306 13.6772L3.81126 11.9614L1.78061 11.55C1.6194 11.5204 1.48732 11.4376 1.38437 11.3016C1.28142 11.1656 1.24139 11.0186 1.26428 10.8606L1.48743 8.91022L0.167914 7.4175C0.0559713 7.30198 0 7.16281 0 7C0 6.83719 0.0559713 6.69802 0.167914 6.5825L1.48743 5.10093L1.26428 3.15058C1.24139 2.99253 1.28142 2.84552 1.38437 2.70956C1.48732 2.57357 1.6194 2.4899 1.78061 2.45855L3.81126 2.04977L4.84306 0.322769C4.92847 0.184937 5.04965 0.089223 5.20659 0.0356296C5.36353 -0.017975 5.51978 -0.0110242 5.67535 0.0564807L7.5 0.862875L9.32465 0.0564807C9.48022 -0.00923928 9.63647 -0.0176063 9.79341 0.0313797C9.95035 0.0803657 10.0715 0.173774 10.1569 0.311607L11.2002 2.04977L13.2194 2.45855C13.3806 2.4899 13.5127 2.57357 13.6156 2.70956C13.7186 2.84552 13.7586 2.99253 13.7357 3.15058L13.5126 5.10093L14.8321 6.5825C14.944 6.69802 15 6.83719 15 7C15 7.16281 14.944 7.30198 14.8321 7.4175L13.5126 8.91022L13.7357 10.8606C13.7586 11.0186 13.7186 11.1656 13.6156 11.3016C13.5127 11.4376 13.3806 11.5204 13.2194 11.55L11.2002 11.9614L10.1569 13.6884C10.0715 13.8262 9.95035 13.9196 9.79341 13.9686C9.63647 14.0176 9.48022 14.0092 9.32465 13.9435L7.5 13.1371L5.67535 13.9435C5.51978 14.0092 5.36353 14.0157 5.20659 13.963C5.04965 13.9103 4.92847 13.8151 4.84306 13.6772Z'
                            fill='currentColor'
                          />
                        </svg>
                      </div>
                    </div>
                  </div>
                  <div className=''>
                    <div className='mb-3 flex items-center gap-x-[7px] text-15 leading-[1.06] tracking-[-0.6px] text-fontGrey'>
                      Email
                      <div className='h-[14px] w-[15px] text-[#039DF7]'>
                        <svg
                          className='h-full w-full'
                          xmlns='http://www.w3.org/2000/svg'
                          viewBox='0 0 15 14'
                          fill='none'
                        >
                          <path
                            d='M6.76759 7.64451L5.62359 6.49738C5.50659 6.37587 5.36315 6.31511 5.19327 6.31511C5.0234 6.31511 4.87469 6.37267 4.74715 6.48779C4.62252 6.61107 4.5602 6.75578 4.5602 6.9219C4.5602 7.08803 4.62252 7.23184 4.74715 7.35335L6.30824 8.86402C6.43819 8.99248 6.5913 9.05671 6.76759 9.05671C6.9439 9.05671 7.09702 8.99248 7.22696 8.86402L10.2528 5.92538C10.3728 5.81027 10.432 5.67018 10.4305 5.5051C10.4291 5.34002 10.366 5.19903 10.2414 5.08213C10.1215 4.97446 9.97851 4.92177 9.81245 4.92408C9.64639 4.92638 9.50813 4.98226 9.39768 5.09172L6.76759 7.64451ZM4.84306 13.6772L3.81126 11.9614L1.78061 11.55C1.6194 11.5204 1.48732 11.4376 1.38437 11.3016C1.28142 11.1656 1.24139 11.0186 1.26428 10.8606L1.48743 8.91022L0.167914 7.4175C0.0559713 7.30198 0 7.16281 0 7C0 6.83719 0.0559713 6.69802 0.167914 6.5825L1.48743 5.10093L1.26428 3.15058C1.24139 2.99253 1.28142 2.84552 1.38437 2.70956C1.48732 2.57357 1.6194 2.4899 1.78061 2.45855L3.81126 2.04977L4.84306 0.322769C4.92847 0.184937 5.04965 0.089223 5.20659 0.0356296C5.36353 -0.017975 5.51978 -0.0110242 5.67535 0.0564807L7.5 0.862875L9.32465 0.0564807C9.48022 -0.00923928 9.63647 -0.0176063 9.79341 0.0313797C9.95035 0.0803657 10.0715 0.173774 10.1569 0.311607L11.2002 2.04977L13.2194 2.45855C13.3806 2.4899 13.5127 2.57357 13.6156 2.70956C13.7186 2.84552 13.7586 2.99253 13.7357 3.15058L13.5126 5.10093L14.8321 6.5825C14.944 6.69802 15 6.83719 15 7C15 7.16281 14.944 7.30198 14.8321 7.4175L13.5126 8.91022L13.7357 10.8606C13.7586 11.0186 13.7186 11.1656 13.6156 11.3016C13.5127 11.4376 13.3806 11.5204 13.2194 11.55L11.2002 11.9614L10.1569 13.6884C10.0715 13.8262 9.95035 13.9196 9.79341 13.9686C9.63647 14.0176 9.48022 14.0092 9.32465 13.9435L7.5 13.1371L5.67535 13.9435C5.51978 14.0092 5.36353 14.0157 5.20659 13.963C5.04965 13.9103 4.92847 13.8151 4.84306 13.6772Z'
                            fill='currentColor'
                          />
                        </svg>
                      </div>
                    </div>
                  </div>
                  <div className=''>
                    <div className='mb-3 flex items-center gap-x-[7px] text-15 leading-[1.06] tracking-[-0.6px] text-fontGrey'>
                      Оплата
                      <div className='h-[14px] w-[15px] text-[#039DF7]'>
                        <svg
                          className='h-full w-full'
                          xmlns='http://www.w3.org/2000/svg'
                          viewBox='0 0 15 14'
                          fill='none'
                        >
                          <path
                            d='M6.76759 7.64451L5.62359 6.49738C5.50659 6.37587 5.36315 6.31511 5.19327 6.31511C5.0234 6.31511 4.87469 6.37267 4.74715 6.48779C4.62252 6.61107 4.5602 6.75578 4.5602 6.9219C4.5602 7.08803 4.62252 7.23184 4.74715 7.35335L6.30824 8.86402C6.43819 8.99248 6.5913 9.05671 6.76759 9.05671C6.9439 9.05671 7.09702 8.99248 7.22696 8.86402L10.2528 5.92538C10.3728 5.81027 10.432 5.67018 10.4305 5.5051C10.4291 5.34002 10.366 5.19903 10.2414 5.08213C10.1215 4.97446 9.97851 4.92177 9.81245 4.92408C9.64639 4.92638 9.50813 4.98226 9.39768 5.09172L6.76759 7.64451ZM4.84306 13.6772L3.81126 11.9614L1.78061 11.55C1.6194 11.5204 1.48732 11.4376 1.38437 11.3016C1.28142 11.1656 1.24139 11.0186 1.26428 10.8606L1.48743 8.91022L0.167914 7.4175C0.0559713 7.30198 0 7.16281 0 7C0 6.83719 0.0559713 6.69802 0.167914 6.5825L1.48743 5.10093L1.26428 3.15058C1.24139 2.99253 1.28142 2.84552 1.38437 2.70956C1.48732 2.57357 1.6194 2.4899 1.78061 2.45855L3.81126 2.04977L4.84306 0.322769C4.92847 0.184937 5.04965 0.089223 5.20659 0.0356296C5.36353 -0.017975 5.51978 -0.0110242 5.67535 0.0564807L7.5 0.862875L9.32465 0.0564807C9.48022 -0.00923928 9.63647 -0.0176063 9.79341 0.0313797C9.95035 0.0803657 10.0715 0.173774 10.1569 0.311607L11.2002 2.04977L13.2194 2.45855C13.3806 2.4899 13.5127 2.57357 13.6156 2.70956C13.7186 2.84552 13.7586 2.99253 13.7357 3.15058L13.5126 5.10093L14.8321 6.5825C14.944 6.69802 15 6.83719 15 7C15 7.16281 14.944 7.30198 14.8321 7.4175L13.5126 8.91022L13.7357 10.8606C13.7586 11.0186 13.7186 11.1656 13.6156 11.3016C13.5127 11.4376 13.3806 11.5204 13.2194 11.55L11.2002 11.9614L10.1569 13.6884C10.0715 13.8262 9.95035 13.9196 9.79341 13.9686C9.63647 14.0176 9.48022 14.0092 9.32465 13.9435L7.5 13.1371L5.67535 13.9435C5.51978 14.0092 5.36353 14.0157 5.20659 13.963C5.04965 13.9103 4.92847 13.8151 4.84306 13.6772Z'
                            fill='currentColor'
                          />
                        </svg>
                      </div>
                    </div>
                  </div>
                </div>
                <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                  <div className='mb-3 text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                    Языки:
                  </div>
                  <div className='text-15 leading-[1.86] tracking-[-0.3px] text-fontGrey'>
                    <span className='text-fontBlack'>Русский:</span> родной язык
                  </div>
                  <div className='text-15 leading-[1.86] tracking-[-0.3px] text-fontGrey'>
                    <span className='text-fontBlack'>Английский:</span>{' '}
                    разговорный язык
                  </div>
                  <div className='text-15 leading-[1.86] tracking-[-0.3px] text-fontGrey'>
                    <span className='text-fontBlack'>Китайский:</span> базовый
                    язык
                  </div>
                  <div className='text-15 leading-[1.86] tracking-[-0.3px] text-fontGrey'>
                    <span className='text-fontBlack'>Испанский:</span> уровень
                    носителя
                  </div>
                </div>
                <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                  <div className='mb-4 text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                    Образование:
                  </div>
                  <div>
                    <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                      Программист-техник
                    </div>
                    <div className='mb-[17px] text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                      Курский Государственный Политехнический Колледж (КГПК)
                      2011 - 2015
                    </div>
                    <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                      Бакалавр Инженер-программист
                    </div>
                    <div className='text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                      Юго-западный Государственный Университет (ЮЗГУ) 2016 -
                      2020
                    </div>
                  </div>
                </div>
                <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                  <div className='mb-4 text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                    Период работы:
                  </div>
                  <div>
                    <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                      NF portal
                    </div>
                    <div className='mb-[17px] text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                      Курск, Россия Главный дизайнер 2018 - по настоящее время
                    </div>
                    <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                      Art-Hall
                    </div>
                    <div className='text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                      Курск, Россия Штатный дизайнер 2015 - 2018
                    </div>
                  </div>
                </div>
                <div className='border-t border-[#D9D9D9] py-[17px] pb-[29px]'>
                  <div className='mb-4 text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                    Сертификаты:
                  </div>
                  <div>
                    <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                      Дизайнер сайтов на Tilda
                    </div>
                    <div className='mb-[17px] text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                      Skillbox (14.07.2023) 1452 4451 4124
                    </div>
                    <div className='text-15 leading-[1.33] tracking-[-0.3px] text-fontBlack'>
                      Дизайнер сайтов на Tilda
                    </div>
                    <div className='text-13 leading-[1.53] tracking-[-0.26px] text-fontGrey'>
                      Skillbox (14.07.2023) 1452 4451 4124
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  )
}

export default page
