'use client'

import Link from 'next/link'
import { useRouter, useSearchParams } from 'next/navigation'
import { cloneElement, useState } from 'react'

import Comment from '@/components/Catalog/Comment'
import Reviews from '@/components/Catalog/Reviews'
import Modal from '@/components/Modal/Modal'

export function WrapperCard({ children, id }) {
  const [showModal, setShowModal] = useState(false)
  const searchParams = useSearchParams()
  const router = useRouter()

  const handleClick = () => {
    console.log('WOOOORK')
    setShowModal(true)

    const params = new URLSearchParams(searchParams)
    params.set('vacancy', id)
    router.replace(`/vacancies/?${params.toString()}`, { scroll: false })
  }

  const handleClose = () => {
    console.log('WOOOORK')
    setShowModal(false)

    const params = new URLSearchParams(searchParams)
    params.delete('vacancy')
    router.replace(`/vacancies/?${params.toString()}`, { scroll: false })
  }

  return (
    <>
      {cloneElement(children, { onClick: handleClick })}
      {showModal && (
        <Modal
          isOpen={showModal}
          onClose={handleClose}
          headerClose={false}
          maxWidth='xl'
        >
          <div className='min-h-screen'>
            <div className='mb-2 flex items-center justify-between px-5'>
              <button
                onClick={handleClose}
                className='flex h-6 w-6 items-center justify-center rounded-[50%] border border-fontDarkGrey'
              >
                <svg
                  className='up-icon h-[10px] w-[10px] flex-[0_0_10px]'
                  xmlns='http://www.w3.org/2000/svg'
                  viewBox='0 0 10 10'
                  fill='none'
                >
                  <path
                    d='M5 6.13324L1.36945 9.76379C1.21196 9.92126 1.02309 10 0.802827 10C0.582568 10 0.393696 9.92126 0.23621 9.76379C0.0787367 9.60631 0 9.41743 0 9.19717C0 8.97691 0.0787367 8.78804 0.23621 8.63056L3.86677 5L0.23621 1.36945C0.0787367 1.21196 0 1.02309 0 0.802828C0 0.582568 0.0787367 0.393696 0.23621 0.23621C0.393696 0.078737 0.582568 0 0.802827 0C1.02309 0 1.21196 0.078737 1.36945 0.23621L5 3.86677L8.63056 0.23621C8.78804 0.078737 8.97691 0 9.19717 0C9.41743 0 9.60631 0.078737 9.76379 0.23621C9.92126 0.393696 10 0.582568 10 0.802828C10 1.02309 9.92126 1.21196 9.76379 1.36945L6.13324 5L9.76379 8.63056C9.92126 8.78804 10 8.97691 10 9.19717C10 9.41743 9.92126 9.60631 9.76379 9.76379C9.60631 9.92126 9.41743 10 9.19717 10C8.97691 10 8.78804 9.92126 8.63056 9.76379L5 6.13324Z'
                    fill='currentColor'
                  />
                </svg>
              </button>
              <Link
                href='/vacancies/1'
                target='_blank'
                className='ml-[19px] flex items-center gap-x-[6px]'
              >
                <span className='text-13 tracking-[-0.52px] text-greenDark hover:underline'>
                  Открыть в новом окне
                </span>
                <div className='h-[10px] w-[10px]'>
                  <svg
                    className='h-full w-full text-greenDark'
                    xmlns='http://www.w3.org/2000/svg'
                    width='10'
                    height='10'
                    viewBox='0 0 10 10'
                    fill='none'
                  >
                    <path
                      d='M1.17211 10C0.84907 10 0.57296 9.88541 0.343776 9.65622C0.114592 9.42704 0 9.15093 0 8.82789V1.17712C0 0.852708 0.114592 0.575419 0.343776 0.345252C0.57296 0.115084 0.84907 0 1.17211 0H4.22528C4.38928 0 4.52795 0.0578078 4.6413 0.173424C4.75465 0.289031 4.81133 0.428909 4.81133 0.59306C4.81133 0.757211 4.75465 0.895593 4.6413 1.0082C4.52795 1.12081 4.38928 1.17712 4.22528 1.17712H1.17211V8.82789H8.82288V5.77472C8.82288 5.61072 8.87971 5.47205 8.99335 5.3587C9.107 5.24535 9.2459 5.18867 9.41005 5.18867C9.5742 5.18867 9.71356 5.24535 9.82813 5.3587C9.94271 5.47205 10 5.61072 10 5.77472V8.82789C10 9.15093 9.88492 9.42704 9.65475 9.65622C9.42458 9.88541 9.14729 10 8.82288 10H1.17211ZM8.82288 1.99944L4.32184 6.50549C4.20515 6.61957 4.06935 6.67388 3.91443 6.66842C3.75949 6.66296 3.62498 6.60319 3.51089 6.48911C3.39681 6.37502 3.33977 6.23944 3.33977 6.08238C3.33977 5.92531 3.39681 5.78973 3.51089 5.67564L8.00943 1.17712H6.28386C6.11985 1.17712 5.98118 1.1203 5.86783 1.00665C5.75448 0.893 5.69781 0.7541 5.69781 0.589949C5.69781 0.425798 5.75448 0.286438 5.86783 0.171868C5.98118 0.0572891 6.11985 0 6.28386 0H10V3.71614C10 3.88015 9.94219 4.01882 9.82658 4.13217C9.71097 4.24552 9.57109 4.30219 9.40694 4.30219C9.24279 4.30219 9.10441 4.24552 8.9918 4.13217C8.87919 4.01882 8.82288 3.88015 8.82288 3.71614V1.99944Z'
                      fill='currentColor'
                    />
                  </svg>
                </div>
              </Link>
            </div>

            <div className='px-[60px]'>
              <div className='flex gap-x-10'>
                {/* Left */}
                <div className='flex-auto'>
                  <div className='mb-6 flex'>
                    <div>
                      <div className='mb-5 text-22 leading-[1.18] tracking-[-0.88px] text-fontBlack'>
                        Создание сайта образовательной организации -
                        интернет-магазина "под ключ" на wordpress
                      </div>
                      <div className='flex items-center gap-x-9'>
                        <div className='flex items-center'>
                          <div className='relative mr-3 flex'>
                            <img
                              className='inline-flex h-[30px] max-h-[30px] w-[30px] max-w-[30px] overflow-hidden rounded-[50%] object-cover'
                              src='/images/project-modal-avatar.svg'
                              alt=''
                            />
                          </div>
                          <span className='text-15 leading-[1.06] tracking-[-0.3px] text-greenDark'>
                            Афанасий В.
                          </span>
                        </div>

                        <div className='flex h-[17px] items-start gap-x-[6px]'>
                          <div className='up-icon h-[14px] w-[14px] text-greenDark'>
                            <svg
                              xmlns='http://www.w3.org/2000/svg'
                              role='image'
                              viewBox='0 0 14 14'
                              fill='none'
                            >
                              <path
                                d='M7 11.6828L3.51263 13.8831C3.37675 13.9705 3.23543 14.0089 3.08868 13.9983C2.94193 13.9876 2.81232 13.9386 2.69984 13.8512C2.58736 13.7638 2.50245 13.652 2.44509 13.5159C2.38772 13.3797 2.37617 13.227 2.41045 13.0578L3.33269 8.9018L0.252428 6.09807C0.126006 5.98254 0.0481134 5.85166 0.0187502 5.70541C-0.010613 5.55917 -0.00548867 5.41656 0.0341232 5.27761C0.0716801 5.13866 0.145831 5.02215 0.256576 4.92808C0.367322 4.83401 0.505718 4.77797 0.671764 4.75994L4.74069 4.38806L6.31713 0.463871C6.38036 0.307091 6.47652 0.190581 6.60561 0.11434C6.73471 0.0381138 6.86617 0 7 0C7.13383 0 7.26529 0.0381138 7.39439 0.11434C7.52348 0.190581 7.61964 0.307091 7.68287 0.463871L9.25931 4.38806L13.3313 4.75994C13.4953 4.77797 13.6327 4.83401 13.7434 4.92808C13.8542 5.02215 13.9283 5.13866 13.9659 5.27761C14.0055 5.41656 14.0106 5.55917 13.9812 5.70541C13.9519 5.85166 13.874 5.98254 13.7476 6.09807L10.6673 8.9018L11.5896 13.0578C11.6238 13.227 11.6123 13.3797 11.5549 13.5159C11.4976 13.652 11.4126 13.7638 11.3002 13.8512C11.1877 13.9386 11.0581 13.9876 10.9113 13.9983C10.7646 14.0089 10.6233 13.9705 10.4874 13.8831L7 11.6828Z'
                                fill='currentColor'
                              />
                            </svg>
                          </div>
                          <span className='text-13 leading-none tracking-[-0.52px] text-fontBlack'>
                            <span className='font-medium'>5.0</span>{' '}
                            <span className='text-fontGrey'>(81 отзыв)</span>
                          </span>
                        </div>

                        <div>
                          <span className='text-13 leading-[1.53] tracking-[-0.52px] text-fontGrey'>
                            Россия, Москва
                          </span>
                        </div>

                        <div>
                          <span className='text-13 leading-[1.53] tracking-[-0.52px] text-fontBlack'>
                            21:30{' '}
                            <span className='text-fontGrey'>местное время</span>
                          </span>
                        </div>
                      </div>
                    </div>
                    <div className='flex flex-[0_0_80px] gap-x-2.5'>
                      <button className='inline-flex h-[35px] w-[35px] items-center justify-center rounded-[50%] border-2 border-[#D1D1D6] leading-[0]'>
                        <div className='up-icon h-[16px] w-[16px] text-greenDark'>
                          <svg
                            xmlns='http://www.w3.org/2000/svg'
                            role='image'
                            viewBox='0 0 18 16'
                            fill='none'
                          >
                            <path d='M9 16C8.82302 16 8.64287 15.9682 8.45955 15.9045C8.27624 15.8409 8.11505 15.7391 7.97598 15.5991L6.66752 14.3963C4.89752 12.7625 3.34376 11.185 2.00626 9.66369C0.668753 8.14238 0 6.52489 0 4.81124C0 3.44077 0.459997 2.29628 1.37999 1.37777C2.3 0.459256 3.44 0 4.79999 0C5.575 0 6.33 0.178608 7.065 0.535824C7.8 0.893055 8.445 1.44887 9 2.20328C9.60501 1.44887 10.26 0.893055 10.965 0.535824C11.67 0.178608 12.415 0 13.2 0C14.56 0 15.7 0.459256 16.62 1.37777C17.54 2.29628 18 3.44077 18 4.81124C18 6.52489 17.3325 8.14363 15.9975 9.66744C14.6625 11.1913 13.105 12.77 11.325 14.4037L10.02 15.6028C9.88249 15.7415 9.72311 15.8424 9.54187 15.9054C9.36062 15.9685 9.18 16 9 16ZM8.325 3.79204C7.91001 3.09758 7.40001 2.54176 6.795 2.12459C6.19001 1.70741 5.525 1.49881 4.79999 1.49881C3.83999 1.49881 3.05 1.81107 2.43 2.43559C1.80999 3.06011 1.49999 3.85413 1.49999 4.81767C1.49999 5.65273 1.7869 6.53441 2.36072 7.46273C2.93453 8.39104 3.62078 9.29159 4.41947 10.1644C5.21815 11.0372 6.04374 11.8507 6.89625 12.6052C7.74875 13.3596 8.45 13.9891 9 14.4937C9.55 13.9991 10.2513 13.3721 11.1038 12.6126C11.9563 11.8532 12.7813 11.0339 13.5788 10.1546C14.3763 9.27525 15.0625 8.37124 15.6375 7.44254C16.2125 6.51385 16.5 5.63675 16.5 4.81124C16.5 3.85199 16.1875 3.06011 15.5625 2.43559C14.9375 1.81107 14.15 1.49881 13.2 1.49881C12.465 1.49881 11.7975 1.7049 11.1975 2.11708C10.5975 2.52927 10.08 3.08759 9.64499 3.79204C9.55999 3.92193 9.4625 4.01685 9.35251 4.07681C9.2425 4.13676 9.11999 4.16674 8.98499 4.16674C8.84999 4.16674 8.725 4.13676 8.61001 4.07681C8.495 4.01685 8.4 3.92193 8.325 3.79204Z' />
                          </svg>
                        </div>
                      </button>
                      <button className='inline-flex h-[35px] w-[35px] items-center justify-center rounded-[50%] border-2 border-[#D1D1D6] leading-[0]'>
                        <div className='up-icon h-[35px] w-[35px] text-greenDark'>
                          <svg
                            xmlns='http://www.w3.org/2000/svg'
                            viewBox='0 0 35 35'
                            fill='none'
                          >
                            <path d='M21.4246 27C20.7092 27 20.1011 26.7458 19.6004 26.2373C19.0996 25.7288 18.8492 25.1114 18.8492 24.3851C18.8492 24.2834 18.8591 24.1655 18.8788 24.0316C18.8986 23.8977 18.9282 23.7771 18.9676 23.67L12.3959 19.8C12.164 20.045 11.8878 20.2412 11.5671 20.3888C11.2464 20.5363 10.9158 20.61 10.5754 20.61C9.86001 20.61 9.25193 20.3563 8.75115 19.8488C8.25038 19.3412 8 18.725 8 18C8 17.275 8.25038 16.6588 8.75115 16.1512C9.25193 15.6437 9.86001 15.39 10.5754 15.39C10.9158 15.39 11.2414 15.4562 11.5523 15.5887C11.8631 15.7213 12.1443 15.91 12.3959 16.155L18.9676 12.315C18.9282 12.2143 18.8986 12.101 18.8788 11.9751C18.8591 11.8492 18.8492 11.7275 18.8492 11.61C18.8492 10.885 19.0996 10.2688 19.6004 9.76124C20.1011 9.25375 20.7092 9 21.4246 9C22.14 9 22.7481 9.25375 23.2488 9.76124C23.7496 10.2688 24 10.885 24 11.61C24 12.335 23.7496 12.9512 23.2488 13.4587C22.7481 13.9662 22.14 14.22 21.4246 14.22C21.0807 14.22 20.7517 14.1612 20.4377 14.0437C20.1237 13.9262 19.8507 13.745 19.6189 13.5L13.0472 17.25C13.0768 17.36 13.1014 17.4862 13.1212 17.6288C13.1409 17.7713 13.1508 17.8962 13.1508 18.0036C13.1508 18.111 13.1409 18.2223 13.1212 18.3374C13.1014 18.4525 13.0768 18.565 13.0472 18.675L19.6189 22.485C19.8507 22.27 20.1172 22.0988 20.4181 21.9713C20.7191 21.8438 21.0546 21.78 21.4246 21.78C22.14 21.78 22.7481 22.0338 23.2488 22.5413C23.7496 23.0488 24 23.665 24 24.39C24 25.115 23.7496 25.7312 23.2488 26.2388C22.7481 26.7463 22.14 27 21.4246 27ZM21.4251 12.72C21.7356 12.72 21.9957 12.6136 22.2054 12.4007C22.415 12.1879 22.5199 11.9241 22.5199 11.6095C22.5199 11.2948 22.4149 11.0312 22.2048 10.8187C21.9948 10.6062 21.7346 10.5 21.4241 10.5C21.1136 10.5 20.8535 10.6064 20.6438 10.8193C20.4342 11.0321 20.3293 11.2959 20.3293 11.6105C20.3293 11.9252 20.4343 12.1888 20.6444 12.4013C20.8544 12.6137 21.1147 12.72 21.4251 12.72ZM10.5759 19.11C10.8864 19.11 11.1465 19.0036 11.3562 18.7907C11.5658 18.5779 11.6707 18.3141 11.6707 17.9995C11.6707 17.6848 11.5657 17.4212 11.3556 17.2087C11.1456 16.9962 10.8853 16.89 10.5749 16.89C10.2644 16.89 10.0043 16.9964 9.79463 17.2093C9.58494 17.4221 9.4801 17.6859 9.4801 18.0005C9.4801 18.3152 9.58511 18.5788 9.79514 18.7913C10.0052 19.0038 10.2654 19.11 10.5759 19.11ZM21.4251 25.5C21.7356 25.5 21.9957 25.3936 22.2054 25.1807C22.415 24.9679 22.5199 24.7041 22.5199 24.3895C22.5199 24.0748 22.4149 23.8112 22.2048 23.5987C21.9948 23.3863 21.7346 23.28 21.4241 23.28C21.1136 23.28 20.8535 23.3864 20.6438 23.5993C20.4342 23.8121 20.3293 24.0759 20.3293 24.3905C20.3293 24.7052 20.4343 24.9688 20.6444 25.1813C20.8544 25.3938 21.1147 25.5 21.4251 25.5Z'></path>
                          </svg>
                        </div>
                      </button>
                    </div>
                  </div>

                  <div className='mb-14'>
                    <div className='max-w-[687px] text-15 leading-[1.33] tracking-[-0.3px] text-fontDarkGrey'>
                      Специализируюсь на проектировании и дизайне сайтов со
                      сложным и нестандартным функционалом (сервисы, порталы,
                      крупные интернет-магазины и тп). <br />
                      <div className='mb-6'></div>
                      Помимо основной работы занимаюсь обучением дизайну сайтов
                      (лендинг, визитка, магазин, проектирование интерфейсов,
                      логика, юзабилити, Figma). <br />
                      <div className='mb-6'></div>
                      2023 г. - спикер на Фриланс-форуме "Цифровые воротнички".
                      Выступала с докладом "Специфика работы с иностранными
                      заказчиками"...
                    </div>
                    <a
                      href='#'
                      className='mt-2.5 flex items-center text-15 tracking-[-0.6px] text-greenDark'
                    >
                      <span className='mr-[6px]'>развернуть</span>
                      <svg
                        className='h-[6px] w-[10px]'
                        xmlns='http://www.w3.org/2000/svg'
                        width='10'
                        height='6'
                        viewBox='0 0 10 6'
                        fill='none'
                      >
                        <path
                          d='M5.00737 6C4.90903 6 4.81808 5.9833 4.73451 5.94989C4.65093 5.91646 4.56981 5.85862 4.49115 5.77636L0.21385 1.30334C0.0712832 1.15425 0 0.974299 0 0.763497C0 0.552695 0.0712832 0.372748 0.21385 0.223658C0.356431 0.0745526 0.530966 0 0.737456 0C0.943945 0 1.11847 0.0745526 1.26104 0.223658L5.00737 4.14142L8.75369 0.223658C8.89626 0.0745526 9.06833 0 9.26991 0C9.47147 0 9.64355 0.0745526 9.78613 0.223658C9.92871 0.372748 10 0.555263 10 0.771202C10 0.98714 9.92871 1.16966 9.78613 1.31877L5.52358 5.77636C5.44493 5.85862 5.36381 5.91646 5.28022 5.94989C5.19665 5.9833 5.1057 6 5.00737 6Z'
                          fill='currentColor'
                        />
                      </svg>
                    </a>
                  </div>

                  <div className='mb-12 flex rounded-[20px] border border-[#D9D9D9] py-[30px]'>
                    <div className='flex flex-[0_0_175px] flex-col items-center justify-center border-r border-[#D9D9D9]'>
                      <div className='mb-4 h-[25px] w-[30px] flex-[0_0_25px]'>
                        <img
                          className='h-full w-full'
                          src='/images/level-icon.svg'
                          alt=''
                        />
                      </div>
                      <div className='text-15 leading-[1.33] tracking-[-0.6px] text-fontBlack'>
                        Эксперт
                      </div>
                      <div className='text-13 leading-[1.53] tracking-[-0.52px] text-fontGrey'>
                        Опыт более 5 лет
                      </div>
                    </div>
                    <div className='pl-[30px] pr-[30px]'>
                      <div className='mb-4 text-19 leading-[1.6] tracking-[0.19px] text-fontBlack'>
                        Требуемый опыт исполнителя
                      </div>
                      <div className='max-w-[437px] text-15 leading-[1.33] tracking-[-0.15px] text-fontDarkGrey'>
                        Опыт работы{' '}
                        <span className='text-fontBlack'>более пяти лет.</span>{' '}
                        Исполнители, которые являются <br /> экспертами в своей
                        сфере и имеют глубокие знания и навыки.
                      </div>
                    </div>
                  </div>

                  <div className='pb-10'>
                    <div className='mb-[22px] text-17 font-medium leading-[1.77] tracking-[0.17px] text-fontBlack'>
                      Необходимые навыки
                    </div>
                    <div className='flex flex-wrap items-center gap-x-[14px] gap-y-2.5'>
                      {[...Array(8)].map((_, index) => {
                        return (
                          <div
                            key={index}
                            className='rounded-[15px] bg-[#F3F3F3] px-3 text-12 leading-[2.50] tracking-[-0.48px] text-fontBlack'
                          >
                            Adobe photoshop
                          </div>
                        )
                      })}
                    </div>
                  </div>

                  <div className='border-t border-[##E3E3E3] pb-9 pt-7'>
                    <div className='mb-[22px] text-17 font-medium leading-[1.77] tracking-[0.17px] text-fontBlack'>
                      Необходимые навыки
                    </div>

                    <div className='flex flex-col gap-y-[18px]'>
                      <div className='flex items-center gap-x-2.5'>
                        <div className='up-icon h-[14px] w-[14px] text-greenDark'>
                          <svg
                            xmlns='http://www.w3.org/2000/svg'
                            role='image'
                            viewBox='0 0 14 14'
                            fill='none'
                          >
                            <path d='M1.95396 12.3817C1.13505 11.5628 0.720987 10.5831 0.711754 9.44256C0.702529 8.30204 1.10547 7.32422 1.92058 6.50911L7.30703 1.12266C7.89339 0.5363 8.60054 0.242725 9.42849 0.24193C10.2564 0.241127 10.9632 0.533538 11.5489 1.11916C12.14 1.71031 12.435 2.41967 12.4338 3.24725C12.4326 4.07482 12.1361 4.78454 11.5442 5.37641L6.66833 10.2523C6.30672 10.6139 5.87443 10.7961 5.37145 10.7989C4.86846 10.8016 4.43539 10.6214 4.07223 10.2583C3.70905 9.89509 3.53437 9.45805 3.54817 8.94716C3.56197 8.43625 3.754 7.99567 4.12425 7.62542L8.60716 3.14251C8.71451 3.03515 8.84175 2.98323 8.98886 2.98673C9.13597 2.99025 9.26203 3.04452 9.36704 3.14953C9.47206 3.25454 9.52515 3.37943 9.52633 3.5242C9.52749 3.66897 9.47439 3.79503 9.36703 3.90238L4.85927 8.41015C4.70216 8.56726 4.62022 8.75211 4.61345 8.96472C4.60669 9.17733 4.67818 9.3585 4.82792 9.50824C4.97765 9.65798 5.15728 9.73067 5.36679 9.72634C5.57631 9.722 5.75687 9.64403 5.90845 9.49245L10.7926 4.60826C11.1736 4.22733 11.3627 3.77325 11.3599 3.24602C11.3571 2.71879 11.1653 2.26471 10.7844 1.88378C10.4034 1.50286 9.94935 1.31102 9.42212 1.30826C8.8949 1.30549 8.44083 1.49458 8.05989 1.87551L2.65849 7.27691C2.0567 7.8787 1.7625 8.60265 1.77587 9.44876C1.78924 10.2949 2.09928 11.0213 2.70598 11.628C3.31821 12.2402 4.04742 12.5506 4.89361 12.5592C5.73981 12.5677 6.46634 12.2686 7.0732 11.6617L12.0998 6.63514C12.2071 6.52778 12.3326 6.4741 12.4762 6.47409C12.6198 6.4741 12.745 6.52745 12.8517 6.63415C12.9584 6.74086 13.0128 6.86711 13.015 7.01291C13.0173 7.15873 12.9647 7.28532 12.8573 7.39268L7.83902 12.411C7.02391 13.2261 6.04401 13.6297 4.89933 13.6218C3.75465 13.614 2.77287 13.2006 1.95396 12.3817Z' />
                          </svg>
                        </div>
                        <span className='text-15 leading-[1.33] tracking-[-0.15px] text-greenDark'>
                          Task_instructions.docx
                        </span>
                        <span className='text-13 leading-[1.53] tracking-[-0.13px] text-fontGrey'>
                          2,13 Мб
                        </span>
                      </div>

                      <div className='flex items-center gap-x-2.5'>
                        <div className='up-icon h-[14px] w-[14px] text-greenDark'>
                          <svg
                            xmlns='http://www.w3.org/2000/svg'
                            role='image'
                            viewBox='0 0 14 14'
                            fill='none'
                          >
                            <path d='M1.95396 12.3817C1.13505 11.5628 0.720987 10.5831 0.711754 9.44256C0.702529 8.30204 1.10547 7.32422 1.92058 6.50911L7.30703 1.12266C7.89339 0.5363 8.60054 0.242725 9.42849 0.24193C10.2564 0.241127 10.9632 0.533538 11.5489 1.11916C12.14 1.71031 12.435 2.41967 12.4338 3.24725C12.4326 4.07482 12.1361 4.78454 11.5442 5.37641L6.66833 10.2523C6.30672 10.6139 5.87443 10.7961 5.37145 10.7989C4.86846 10.8016 4.43539 10.6214 4.07223 10.2583C3.70905 9.89509 3.53437 9.45805 3.54817 8.94716C3.56197 8.43625 3.754 7.99567 4.12425 7.62542L8.60716 3.14251C8.71451 3.03515 8.84175 2.98323 8.98886 2.98673C9.13597 2.99025 9.26203 3.04452 9.36704 3.14953C9.47206 3.25454 9.52515 3.37943 9.52633 3.5242C9.52749 3.66897 9.47439 3.79503 9.36703 3.90238L4.85927 8.41015C4.70216 8.56726 4.62022 8.75211 4.61345 8.96472C4.60669 9.17733 4.67818 9.3585 4.82792 9.50824C4.97765 9.65798 5.15728 9.73067 5.36679 9.72634C5.57631 9.722 5.75687 9.64403 5.90845 9.49245L10.7926 4.60826C11.1736 4.22733 11.3627 3.77325 11.3599 3.24602C11.3571 2.71879 11.1653 2.26471 10.7844 1.88378C10.4034 1.50286 9.94935 1.31102 9.42212 1.30826C8.8949 1.30549 8.44083 1.49458 8.05989 1.87551L2.65849 7.27691C2.0567 7.8787 1.7625 8.60265 1.77587 9.44876C1.78924 10.2949 2.09928 11.0213 2.70598 11.628C3.31821 12.2402 4.04742 12.5506 4.89361 12.5592C5.73981 12.5677 6.46634 12.2686 7.0732 11.6617L12.0998 6.63514C12.2071 6.52778 12.3326 6.4741 12.4762 6.47409C12.6198 6.4741 12.745 6.52745 12.8517 6.63415C12.9584 6.74086 13.0128 6.86711 13.015 7.01291C13.0173 7.15873 12.9647 7.28532 12.8573 7.39268L7.83902 12.411C7.02391 13.2261 6.04401 13.6297 4.89933 13.6218C3.75465 13.614 2.77287 13.2006 1.95396 12.3817Z' />
                          </svg>
                        </div>
                        <span className='text-15 leading-[1.33] tracking-[-0.15px] text-greenDark'>
                          Scheme.jpg
                        </span>
                        <span className='text-13 leading-[1.53] tracking-[-0.13px] text-fontGrey'>
                          618 Кб
                        </span>
                      </div>

                      <div className='flex items-center gap-x-2.5'>
                        <div className='up-icon h-[14px] w-[14px] text-greenDark'>
                          <svg
                            xmlns='http://www.w3.org/2000/svg'
                            role='image'
                            viewBox='0 0 14 14'
                            fill='none'
                          >
                            <path d='M1.95396 12.3817C1.13505 11.5628 0.720987 10.5831 0.711754 9.44256C0.702529 8.30204 1.10547 7.32422 1.92058 6.50911L7.30703 1.12266C7.89339 0.5363 8.60054 0.242725 9.42849 0.24193C10.2564 0.241127 10.9632 0.533538 11.5489 1.11916C12.14 1.71031 12.435 2.41967 12.4338 3.24725C12.4326 4.07482 12.1361 4.78454 11.5442 5.37641L6.66833 10.2523C6.30672 10.6139 5.87443 10.7961 5.37145 10.7989C4.86846 10.8016 4.43539 10.6214 4.07223 10.2583C3.70905 9.89509 3.53437 9.45805 3.54817 8.94716C3.56197 8.43625 3.754 7.99567 4.12425 7.62542L8.60716 3.14251C8.71451 3.03515 8.84175 2.98323 8.98886 2.98673C9.13597 2.99025 9.26203 3.04452 9.36704 3.14953C9.47206 3.25454 9.52515 3.37943 9.52633 3.5242C9.52749 3.66897 9.47439 3.79503 9.36703 3.90238L4.85927 8.41015C4.70216 8.56726 4.62022 8.75211 4.61345 8.96472C4.60669 9.17733 4.67818 9.3585 4.82792 9.50824C4.97765 9.65798 5.15728 9.73067 5.36679 9.72634C5.57631 9.722 5.75687 9.64403 5.90845 9.49245L10.7926 4.60826C11.1736 4.22733 11.3627 3.77325 11.3599 3.24602C11.3571 2.71879 11.1653 2.26471 10.7844 1.88378C10.4034 1.50286 9.94935 1.31102 9.42212 1.30826C8.8949 1.30549 8.44083 1.49458 8.05989 1.87551L2.65849 7.27691C2.0567 7.8787 1.7625 8.60265 1.77587 9.44876C1.78924 10.2949 2.09928 11.0213 2.70598 11.628C3.31821 12.2402 4.04742 12.5506 4.89361 12.5592C5.73981 12.5677 6.46634 12.2686 7.0732 11.6617L12.0998 6.63514C12.2071 6.52778 12.3326 6.4741 12.4762 6.47409C12.6198 6.4741 12.745 6.52745 12.8517 6.63415C12.9584 6.74086 13.0128 6.86711 13.015 7.01291C13.0173 7.15873 12.9647 7.28532 12.8573 7.39268L7.83902 12.411C7.02391 13.2261 6.04401 13.6297 4.89933 13.6218C3.75465 13.614 2.77287 13.2006 1.95396 12.3817Z' />
                          </svg>
                        </div>
                        <span className='text-15 leading-[1.33] tracking-[-0.15px] text-greenDark'>
                          Hfhnbhjfl_01-08-2023_dklljf...ff.pdf
                        </span>
                        <span className='text-13 leading-[1.53] tracking-[-0.13px] text-fontGrey'>
                          4,02 Мб
                        </span>
                      </div>
                    </div>
                  </div>

                  <div className='mb-10 border-t border-[##E3E3E3] pt-[18px]'>
                    <div>
                      <Reviews />
                    </div>

                    <div className='border-b border-[##E3E3E3]'>
                      {[...Array(5)].map((_, index) => {
                        return (
                          <Comment key={index} initialValue={3} maxRating={4} />
                        )
                      })}
                    </div>

                    <div className='mt-[30px] flex justify-center'>
                      <button className='btn-primary px-5'>
                        Загрузить еще
                      </button>
                    </div>
                  </div>

                  <div className='pb-9'>
                    <div className='mb-4 text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                      Дополнительная информация
                    </div>
                    <div className='max-w-[687px] text-15 leading-[1.33] tracking-[-0.3px] text-fontDarkGrey'>
                      Специализируюсь на проектировании и дизайне сайтов со
                      сложным и нестандартным функционалом (сервисы, порталы,
                      крупные интернет-магазины и тп). <br />
                      <div className='mb-6'></div>
                      Помимо основной работы занимаюсь обучением дизайну сайтов
                      (лендинг, визитка, магазин, проектирование интерфейсов,
                      логика, юзабилити, Figma). <br />
                      <div className='mb-6'></div>
                      2023 г. - спикер на Фриланс-форуме "Цифровые воротнички".
                      Выступала с докладом "Специфика работы с иностранными
                      заказчиками"...
                    </div>
                    <a
                      href='#'
                      className='mt-2.5 flex items-center text-15 tracking-[-0.6px] text-greenDark'
                    >
                      <span className='mr-[6px]'>развернуть</span>
                      <svg
                        className='h-[6px] w-[10px]'
                        xmlns='http://www.w3.org/2000/svg'
                        width='10'
                        height='6'
                        viewBox='0 0 10 6'
                        fill='none'
                      >
                        <path
                          d='M5.00737 6C4.90903 6 4.81808 5.9833 4.73451 5.94989C4.65093 5.91646 4.56981 5.85862 4.49115 5.77636L0.21385 1.30334C0.0712832 1.15425 0 0.974299 0 0.763497C0 0.552695 0.0712832 0.372748 0.21385 0.223658C0.356431 0.0745526 0.530966 0 0.737456 0C0.943945 0 1.11847 0.0745526 1.26104 0.223658L5.00737 4.14142L8.75369 0.223658C8.89626 0.0745526 9.06833 0 9.26991 0C9.47147 0 9.64355 0.0745526 9.78613 0.223658C9.92871 0.372748 10 0.555263 10 0.771202C10 0.98714 9.92871 1.16966 9.78613 1.31877L5.52358 5.77636C5.44493 5.85862 5.36381 5.91646 5.28022 5.94989C5.19665 5.9833 5.1057 6 5.00737 6Z'
                          fill='currentColor'
                        />
                      </svg>
                    </a>
                  </div>

                  <div className='flex flex-col border-t border-[#E3E3E3] pt-7'>
                    <div className='mb-[3px] text-17 font-medium leading-[2.11] tracking-[0.17px] text-fontBlack'>
                      Часто задаваемые вопросы
                    </div>

                    <button className='flex items-center justify-between gap-x-1 py-3'>
                      <div className='text-15 leading-[2.13] tracking-[-0.45px] text-fontDarkGrey'>
                        Как зарегистрироваться на нашей бирже?
                      </div>
                      <div className='up-icon h-[9px] w-[14px] text-greenDark'>
                        <svg
                          xmlns='http://www.w3.org/2000/svg'
                          role='image'
                          viewBox='0 0 14 9'
                          fill='none'
                        >
                          <path d='M7.01031 9C6.87265 9 6.74532 8.97494 6.62832 8.92483C6.5113 8.87469 6.39773 8.78793 6.28761 8.66455L0.299389 1.955C0.0997965 1.73137 0 1.46145 0 1.14525C0 0.829042 0.0997965 0.559123 0.299389 0.335487C0.499003 0.111829 0.743352 0 1.03244 0C1.32152 0 1.56586 0.111829 1.76546 0.335487L7.01031 6.21212L12.2552 0.335487C12.4548 0.111829 12.6957 0 12.9779 0C13.2601 0 13.501 0.111829 13.7006 0.335487C13.9002 0.559123 14 0.832895 14 1.1568C14 1.48071 13.9002 1.75449 13.7006 1.97815L7.73302 8.66455C7.6229 8.78793 7.50933 8.87469 7.39231 8.92483C7.27531 8.97494 7.14798 9 7.01031 9Z' />
                        </svg>
                      </div>
                    </button>
                    <button className='flex items-center justify-between gap-x-1 py-3'>
                      <div className='text-15 leading-[2.13] tracking-[-0.45px] text-fontDarkGrey'>
                        Как создать и настроить профиль исполнителя или
                        заказчика?
                      </div>
                      <div className='up-icon h-[9px] w-[14px] text-greenDark'>
                        <svg
                          xmlns='http://www.w3.org/2000/svg'
                          role='image'
                          viewBox='0 0 14 9'
                          fill='none'
                        >
                          <path d='M7.01031 9C6.87265 9 6.74532 8.97494 6.62832 8.92483C6.5113 8.87469 6.39773 8.78793 6.28761 8.66455L0.299389 1.955C0.0997965 1.73137 0 1.46145 0 1.14525C0 0.829042 0.0997965 0.559123 0.299389 0.335487C0.499003 0.111829 0.743352 0 1.03244 0C1.32152 0 1.56586 0.111829 1.76546 0.335487L7.01031 6.21212L12.2552 0.335487C12.4548 0.111829 12.6957 0 12.9779 0C13.2601 0 13.501 0.111829 13.7006 0.335487C13.9002 0.559123 14 0.832895 14 1.1568C14 1.48071 13.9002 1.75449 13.7006 1.97815L7.73302 8.66455C7.6229 8.78793 7.50933 8.87469 7.39231 8.92483C7.27531 8.97494 7.14798 9 7.01031 9Z' />
                        </svg>
                      </div>
                    </button>
                    <button className='flex items-center justify-between gap-x-1 py-3'>
                      <div className='text-15 leading-[2.13] tracking-[-0.45px] text-fontDarkGrey'>
                        Могу ли я иметь одновременно несколько учетных записей
                        на одной бирже?
                      </div>
                      <div className='up-icon h-[9px] w-[14px] text-greenDark'>
                        <svg
                          xmlns='http://www.w3.org/2000/svg'
                          role='image'
                          viewBox='0 0 14 9'
                          fill='none'
                        >
                          <path d='M7.01031 9C6.87265 9 6.74532 8.97494 6.62832 8.92483C6.5113 8.87469 6.39773 8.78793 6.28761 8.66455L0.299389 1.955C0.0997965 1.73137 0 1.46145 0 1.14525C0 0.829042 0.0997965 0.559123 0.299389 0.335487C0.499003 0.111829 0.743352 0 1.03244 0C1.32152 0 1.56586 0.111829 1.76546 0.335487L7.01031 6.21212L12.2552 0.335487C12.4548 0.111829 12.6957 0 12.9779 0C13.2601 0 13.501 0.111829 13.7006 0.335487C13.9002 0.559123 14 0.832895 14 1.1568C14 1.48071 13.9002 1.75449 13.7006 1.97815L7.73302 8.66455C7.6229 8.78793 7.50933 8.87469 7.39231 8.92483C7.27531 8.97494 7.14798 9 7.01031 9Z' />
                        </svg>
                      </div>
                    </button>
                    <button className='flex items-center justify-between gap-x-1 py-3'>
                      <div className='text-15 leading-[2.13] tracking-[-0.45px] text-fontDarkGrey'>
                        Как настроить параметры проекта и указать бюджет?
                      </div>
                      <div className='up-icon h-[9px] w-[14px] text-greenDark'>
                        <svg
                          xmlns='http://www.w3.org/2000/svg'
                          role='image'
                          viewBox='0 0 14 9'
                          fill='none'
                        >
                          <path d='M7.01031 9C6.87265 9 6.74532 8.97494 6.62832 8.92483C6.5113 8.87469 6.39773 8.78793 6.28761 8.66455L0.299389 1.955C0.0997965 1.73137 0 1.46145 0 1.14525C0 0.829042 0.0997965 0.559123 0.299389 0.335487C0.499003 0.111829 0.743352 0 1.03244 0C1.32152 0 1.56586 0.111829 1.76546 0.335487L7.01031 6.21212L12.2552 0.335487C12.4548 0.111829 12.6957 0 12.9779 0C13.2601 0 13.501 0.111829 13.7006 0.335487C13.9002 0.559123 14 0.832895 14 1.1568C14 1.48071 13.9002 1.75449 13.7006 1.97815L7.73302 8.66455C7.6229 8.78793 7.50933 8.87469 7.39231 8.92483C7.27531 8.97494 7.14798 9 7.01031 9Z' />
                        </svg>
                      </div>
                    </button>
                    <button className='flex items-center justify-between gap-x-1 py-3'>
                      <div className='text-15 leading-[2.13] tracking-[-0.45px] text-fontDarkGrey'>
                        Как найти подходящего исполнителя для моего проекта?
                      </div>
                      <div className='up-icon h-[9px] w-[14px] text-greenDark'>
                        <svg
                          xmlns='http://www.w3.org/2000/svg'
                          role='image'
                          viewBox='0 0 14 9'
                          fill='none'
                        >
                          <path d='M7.01031 9C6.87265 9 6.74532 8.97494 6.62832 8.92483C6.5113 8.87469 6.39773 8.78793 6.28761 8.66455L0.299389 1.955C0.0997965 1.73137 0 1.46145 0 1.14525C0 0.829042 0.0997965 0.559123 0.299389 0.335487C0.499003 0.111829 0.743352 0 1.03244 0C1.32152 0 1.56586 0.111829 1.76546 0.335487L7.01031 6.21212L12.2552 0.335487C12.4548 0.111829 12.6957 0 12.9779 0C13.2601 0 13.501 0.111829 13.7006 0.335487C13.9002 0.559123 14 0.832895 14 1.1568C14 1.48071 13.9002 1.75449 13.7006 1.97815L7.73302 8.66455C7.6229 8.78793 7.50933 8.87469 7.39231 8.92483C7.27531 8.97494 7.14798 9 7.01031 9Z' />
                        </svg>
                      </div>
                    </button>
                  </div>
                </div>

                {/* Right */}
                <div className='flex-[0_0_32.605%]'>
                  <div className='sticky top-0 rounded-[30px] border border-[#DBDBDB] p-[30px]'>
                    <div className='mb-6 text-17 tracking-[0.17px] text-fontBlack'>
                      Условия проекта
                    </div>

                    <div className='flex flex-col gap-y-5 border-b border-[#DBDBDB] pb-[30px]'>
                      <div>
                        <div className='flex items-center justify-between gap-x-1 text-15 leading-[1.06] tracking-[-0.3px] text-fontDarkGrey'>
                          <div>
                            <div className='up-icon mr-[6px] h-[16px] w-[16px] text-greenDark'>
                              <svg
                                xmlns='http://www.w3.org/2000/svg'
                                viewBox='0 0 16 16'
                                fill='none'
                              >
                                <path
                                  d='M9.72941 15.5627C9.43805 15.8542 9.08403 16 8.66735 16C8.25067 16 7.89664 15.8542 7.60526 15.5627L0.430541 8.38352C0.278349 8.23123 0.16854 8.06435 0.101116 7.88288C0.0337054 7.70142 0 7.50972 0 7.30776V1.48364C0 1.06567 0.142172 0.713908 0.426517 0.428345C0.710862 0.142782 1.06189 0 1.4796 0H7.30011C7.50194 0 7.69787 0.034254 7.88791 0.102762C8.07794 0.171257 8.24905 0.281648 8.40124 0.433935L15.5499 7.58888C15.85 7.88912 16 8.2474 16 8.66372C16 9.08005 15.85 9.43833 15.5499 9.73856L9.72941 15.5627ZM8.70457 14.539L14.5251 8.71493L7.30011 1.48364H1.4796V7.30776L8.70457 14.539ZM3.4979 4.55857C3.78871 4.55857 4.03937 4.45325 4.24988 4.2426C4.46038 4.03196 4.56563 3.78115 4.56563 3.49016C4.56563 3.19918 4.46038 2.94836 4.24988 2.73772C4.03937 2.52709 3.78871 2.42177 3.4979 2.42177C3.20709 2.42177 2.95643 2.52709 2.74593 2.73772C2.53541 2.94836 2.43016 3.19918 2.43016 3.49016C2.43016 3.78115 2.53541 4.03196 2.74593 4.2426C2.95643 4.45325 3.20709 4.55857 3.4979 4.55857Z'
                                  fill='currentColor'
                                />
                              </svg>
                            </div>
                            <span>Заработная плата</span>
                          </div>
                          <strong className='font-normal text-fontBlack'>
                            68 000 ₽ / месяц
                          </strong>
                        </div>
                      </div>

                      <div>
                        <div className='flex items-center justify-between gap-x-1 text-15 leading-[1.06] tracking-[-0.3px] text-fontDarkGrey'>
                          <div>
                            <div className='up-icon mr-[6px] h-[16px] w-[16px] text-greenDark'>
                              <svg
                                xmlns='http://www.w3.org/2000/svg'
                                viewBox='0 0 14 17'
                                fill='none'
                              >
                                <path d='M5.28394 1.44306C5.08608 1.44306 4.92114 1.37321 4.78914 1.23349C4.65712 1.09377 4.59111 0.921555 4.59111 0.716854C4.59111 0.512141 4.65712 0.341486 4.78914 0.204891C4.92114 0.0682968 5.08608 0 5.28394 0H8.71303C8.91089 0 9.07582 0.0687729 9.20783 0.206319C9.33985 0.343865 9.40586 0.51559 9.40586 0.721493C9.40586 0.926193 9.33985 1.09763 9.20783 1.23581C9.07582 1.37398 8.91089 1.44306 8.71303 1.44306H5.28394ZM7.00007 10.3675C7.19672 10.3675 7.36103 10.2986 7.493 10.1608C7.62496 10.0229 7.69093 9.85209 7.69093 9.64833V6.45066C7.69093 6.24689 7.62442 6.07609 7.4914 5.93826C7.35837 5.80042 7.19354 5.7315 6.9969 5.7315C6.80024 5.7315 6.63593 5.80042 6.50396 5.93826C6.37201 6.07609 6.30603 6.24689 6.30603 6.45066V9.64833C6.30603 9.85209 6.37254 10.0229 6.50557 10.1608C6.63859 10.2986 6.80343 10.3675 7.00007 10.3675ZM6.99778 17C6.03547 17 5.13008 16.8085 4.28158 16.4255C3.43309 16.0425 2.69147 15.5218 2.05672 14.8633C1.42197 14.2048 0.9205 13.4351 0.552308 12.554C0.184103 11.673 0 10.7329 0 9.73368C0 8.73447 0.184236 7.79427 0.552709 6.91308C0.921194 6.0319 1.42279 5.26152 2.05748 4.60195C2.6922 3.94238 3.43377 3.42079 4.28221 3.03717C5.13064 2.65353 6.03606 2.46172 6.99848 2.46172C7.83584 2.46172 8.63018 2.60487 9.38151 2.89118C10.1328 3.17748 10.8112 3.58209 11.4165 4.10501L11.9808 3.51884C12.118 3.37637 12.2809 3.30513 12.4695 3.30513C12.6581 3.30513 12.821 3.37689 12.9582 3.52043C13.0954 3.66396 13.164 3.83366 13.164 4.02953C13.164 4.22539 13.0954 4.39457 12.9582 4.53706L12.3968 5.12006C12.8664 5.69794 13.251 6.36743 13.5506 7.12852C13.8502 7.88963 14 8.75786 14 9.73323C14 10.7329 13.8155 11.6734 13.4465 12.5549C13.0775 13.4363 12.5754 14.2061 11.9404 14.8643C11.3054 15.5224 10.5634 16.043 9.71454 16.4258C8.86566 16.8086 7.96007 17 6.99778 17ZM6.99797 15.4953C8.54044 15.4953 9.85159 14.9355 10.9314 13.816C12.0113 12.6965 12.5512 11.3357 12.5512 9.73376C12.5512 8.13181 12.0114 6.77009 10.932 5.64861C9.85246 4.52714 8.54148 3.9664 6.999 3.9664C5.45653 3.9664 4.14537 4.52696 3.06553 5.64807C1.9857 6.76919 1.44578 8.13073 1.44578 9.73269C1.44578 11.3346 1.98553 12.6956 3.06501 13.8155C4.1445 14.9354 5.45549 15.4953 6.99797 15.4953Z' />
                              </svg>
                            </div>
                            <span>Тип занятости</span>
                          </div>
                          <strong className='font-normal text-fontBlack'>
                            Полная
                          </strong>
                        </div>
                      </div>
                    </div>

                    <div className='my-6 text-17 tracking-[0.17px] text-fontBlack'>
                      Активность
                    </div>

                    <div className='flex flex-col gap-y-5 pb-[30px]'>
                      <div>
                        <div className='flex items-center justify-between gap-x-1 text-15 leading-[1.06] tracking-[-0.3px] text-fontDarkGrey'>
                          <span>Статус вакансии</span>
                          <strong className='font-normal text-greenDark'>
                            Открыта
                          </strong>
                        </div>
                      </div>
                      <div>
                        <div className='flex items-center justify-between gap-x-1 text-15 leading-[1.06] tracking-[-0.3px] text-fontDarkGrey'>
                          <span>Количество заявок</span>
                          <strong className='font-normal text-fontBlack'>
                            28
                          </strong>
                        </div>
                      </div>
                      <div>
                        <div className='flex items-center justify-between gap-x-1 text-15 leading-[1.06] tracking-[-0.3px] text-fontDarkGrey'>
                          <span>Количество просмотров</span>
                          <strong className='font-normal text-fontBlack'>
                            118
                          </strong>
                        </div>
                      </div>
                      <div>
                        <div className='flex items-center justify-between gap-x-1 text-15 leading-[1.06] tracking-[-0.3px] text-fontDarkGrey'>
                          <span>Заказчик заходил</span>
                          <strong className='font-normal text-fontBlack'>
                            3 часа назад
                          </strong>
                        </div>
                      </div>
                      <div>
                        <div className='flex items-center justify-between gap-x-1 text-15 leading-[1.06] tracking-[-0.3px] text-fontDarkGrey'>
                          <span>Опубликован</span>
                          <strong className='font-normal text-fontBlack'>
                            08 авг 2023
                          </strong>
                        </div>
                      </div>
                    </div>

                    <Link
                      href='/vacancies/send-invite'
                      className='btn-primary inline-flex h-10 w-full items-center justify-center px-5 tracking-[-0.6px]'
                    >
                      Отправить заявку
                    </Link>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </Modal>
      )}
    </>
  )
}
